HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8hx.h
/**
 * @file config_stc8ax.h
 * @author MContour (m-contour@qq.com)
 * @brief core and peripheral definition for stc8hx 
 * @details This file contains all the peripheral register's definitions, bits 
 *          definitions and memory mapping for STC8x Connectivity line.
 * @version 0.1
 * @date 2022-04-27
 * 
 * @copyright Apache 2.0 LICENSE
 * 
 *****************************************************************************
 * Copyright (c) 2022 MContour m-contour@qq.com
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * 
 *     http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *****************************************************************************
 */
#ifndef __CONFIG_STC8HX_H__
#define __CONFIG_STC8HX_H__

#include "base_stc8x.h"

/**
 * @defgroup Special_function_registers
 * Special function registers locate at the expension RAM area.
 * If you want to read/write the special function registers, the BIT7 of P_SW2 needs to be set as 1.
 */

/**
 * @defgroup Peripherals
 * Peripherals basic usage functions
 */

/** @addtogroup STC
 * @{
 */

/** @defgroup configuration
 * @{
 */


//! kernel special function register setting 
sfr ACC         =   0xE0;                      //!< accumulator
sfr B           =   0xF0;                      //!< B register
sfr PSW         =   0xD0;                      //!< program state register
sfr SP          =   0x81;                      //!< stack pointer
sfr DPL         =   0x82;                      //!< Data Pointer (low byte)
sfr DPH         =   0x83;                      //!< Data Pointer (high byte)
sfr TA          =   0xAE;                      //!< DPTR timing control register
sfr DPS         =   0xE3;                      //!< DPTR pointer selector
sfr DPL1        =   0xE4;                      //!< The second set of data pointers (low bytes)
sfr DPH1        =   0xE5;                      //!< The second set of data pointers (high bytes)
sbit CY         =   PSW^7;                              /*!< carry/borrow flag bit */
sbit AC         =   PSW^6;                              /*!< auxiliary carry/borrow flag bit */
sbit F0         =   PSW^5;                              /*!< user flag bit 0 */
sbit RS1        =   PSW^4;                              /*!< working state selection bit RS1 */
sbit RS0        =   PSW^3;                              /*!< working state selection bit RS0 */
sbit OV         =   PSW^2;                              /*!< overflow flag bit */
sbit F1         =   PSW^1;                              /*!< user flag bit 1 */
sbit P          =   PSW^0;                              /*!< party check flag bit */

/** @defgroup Peripheral_memory_map
 * @{
 */

//! system management special function register setting 
/* bus speed control register setting */
#define     BUS_SPEED_ADDR              0xA1

/* Bit definition for BUS_SPEED register */
// * RW_S configuration
#define     BUS_SPEED_RW_S              0xC0 /*!< RW_S[1:0] bits (control line selection) */
#define     BUS_SPEED_RW_S_0            0x40 /*!< Bit 0 */
#define     BUS_SPEED_RW_S_1            0x80 /*!< Bit 1 */

#define     BUS_SPEED_RW_S_GROUP1       0x00 /*!< select P4.4 pin as RD and P4.3 as WR */
#define     BUS_SPEED_RW_S_GROUP2       0x40 /*!< select P3.7 pin as RD and P3.6 as WR */
#define     BUS_SPEED_RW_S_GROUP3       0x80 /*!< select P4.2 pin as RD and P4.0 as WR */

// * SPEED configuration
#define     BUS_SPEED_SPEED             0x03 /*!< SPEED[1:0] bits (bus read/write speed control) */
#define     BUS_SPEED_SPEED_0           0x01 /*!< Bit 0 */
#define     BUS_SPEED_SPEED_1           0x02 /*!< Bit 1 */

#define     BUS_SPEED_SPEED_VAL0        0x00 /*!< speed numeric value 0 */
#define     BUS_SPEED_SPEED_VAL1        0x01 /*!< speed numeric value 1 */
#define     BUS_SPEED_SPEED_VAL2        0x02 /*!< speed numeric value 2 */
#define     BUS_SPEED_SPEED_VAL3        0x03 /*!< speed numeric value 3 */


sfr BUS_SPEED   =   BUS_SPEED_ADDR; //! bus speed control register

/*  auxiliary register setting */
#define     AUXR_ADDR                   0x8E

/* Bit definition for AUXR register */
// * EXTRAM configuration
#define     AUXR_EXTRAM                 0x02 /*!< external RAM access control */

sfr AUXR        =   AUXR_ADDR;      //! auxiliary register

/* peripheral port switch register setting */
#define     PERIPHERAL_PORT_SW1_ADDR    0xA2
#define     PERIPHERAL_PORT_SW2_ADDR    0xBA

/* Bit definition for P_SW1 register */
// * S1_S configuration
#define     P_SW1_S1_S                  0xC0 /*!< S1_S[1:0] bits (serial port 1 function pins selection) */
#define     P_SW1_S1_S_0                0x40 /*!< Bit 0 TxD */
#define     P_SW1_S1_S_1                0x80 /*!< Bit 1 RxD */

#define     P_SW1_S1_S_GROUP1           0x00 /*!< select P3.0 pin as RxD and P3.1 as TxD */
#define     P_SW1_S1_S_GROUP2           0x40 /*!< select P3.6 pin as RxD and P3.7 as TxD */
#define     P_SW1_S1_S_GROUP3           0x80 /*!< select P1.6 pin as RxD and P1.7 as TxD */
#define     P_SW1_S1_S_GROUP4           0xC0 /*!< select P4.3 pin as RxD and P4.4 as TxD */

// * CCP_S configuration
#define     P_SW1_CCP_S                 0x30 /*!< CCP_S[1:0] bits (PCA function pins selection) */
#define     P_SW1_CCP_S_0               0x10 /*!< Bit 0 */
#define     P_SW1_CCP_S_1               0x20 /*!< Bit 1 */

#define     P_SW1_CCP_S_GROUP1          0x00 /*!< select P1.2 pin as ECI, P1.7 as CPP0, P1.6 as CPP1, P1.5 as CPP2, P1.4 as CPP3 */
#define     P_SW1_CCP_S_GROUP2          0x10 /*!< select P2.2 pin as ECI, P2.3 as CPP0, P2.4 as CPP1, P2.5 as CPP2, P2.6 as CPP3 */
#define     P_SW1_CCP_S_GROUP3          0x20 /*!< select P7.4 pin as ECI, P7.0 as CPP0, P7.1 as CPP1, P7.2 as CPP2, P7.3 as CPP3 */
#define     P_SW1_CCP_S_GROUP4          0x30 /*!< select P3.5 pin as ECI, P3.3 as CPP0, P3.2 as CPP1, P3.1 as CPP2, P3.0 as CPP3 */

// * SPI_S configuration
#define     P_SW1_SPI_S                 0x0C /*!< SPI_S[1:0] bits (SPI function pins selection) */
#define     P_SW1_SPI_S_0               0x04 /*!< Bit 0 */
#define     P_SW1_SPI_S_1               0x08 /*!< Bit 1 */

