HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8hx.h
#define     P_SW1_SPI_S_GROUP1          0x00 /*!< select P1.2 pin as SS, P1.3 as MOSI, P1.4 as MISO, P1.5 as SCLK */
#define     P_SW1_SPI_S_GROUP2          0x04 /*!< select P2.2 pin as SS, P2.3 as MOSI, P2.4 as MISO, P2.5 as SCLK */
#define     P_SW1_SPI_S_GROUP3          0x08 /*!< select P7.4 pin as SS, P7.5 as MOSI, P7.6 as MISO, P7.7 as SCLK */
#define     P_SW1_SPI_S_GROUP4          0x0C /*!< select P3.5 pin as SS, P3.4 as MOSI, P3.3 as MISO, P3.2 as SCLK */

/* Bit definition for P_SW1 register */
// * EAXFR configuration
#define     P_SW2_EAXFR                 0x80 /*!< XFR control register */

// * I2C_S configuration
#define     P_SW2_I2C_S                 0x30 /*!< I2C_S[1:0] bits (I2C function pins selection) */
#define     P_SW2_I2C_S_0               0x10 /*!< Bit 0 SDA */
#define     P_SW2_I2C_S_1               0x20 /*!< Bit 1 SCL */

#define     P_SW2_I2C_S_GROUP1          0x00 /*!< select P1.5 pin as SCL, P1.4 as SDA */
#define     P_SW2_I2C_S_GROUP2          0x10 /*!< select P2.5 pin as SCL, P2.4 as SDA */
#define     P_SW2_I2C_S_GROUP3          0x20 /*!< select P7.7 pin as SCL, P7.6 as SDA */
#define     P_SW2_I2C_S_GROUP4          0x30 /*!< select P3.2 pin as SCL, P3.3 as SDA */

// * CMPO_S configuration
#define     P_SW2_CMPO_S                0x08 /*!< CMPO selection: [0] P3.4; [1] P4.1 */

// * S4_S configuration
#define     P_SW2_S4_S                  0x04 /*!< serial port 4 function pins selection: [0] RxD4=P0.2, TxD4=P0.3; [1] RxD4=P5.2, TxD4=P5.3 */

// * S3_S configuration
#define     P_SW2_S3_S                  0x02 /*!< serial port 3 function pins selection: [0] RxD3=P0.0, TxD3=P0.1; [1] RxD3=P5.0, TxD3=P5.1  */

// * S2_S configuration
#define     P_SW2_S2_S                  0x01 /*!< serial port 2 function pins selection: [0] RxD2=P1.0, TxD2=P1.1; [1] RxD2=P4.0, TxD2=P4.2  */

sfr P_SW1       =   PERIPHERAL_PORT_SW1_ADDR;   //!< Peripheral Port Switch Register 1
sfr P_SW2       =   PERIPHERAL_PORT_SW2_ADDR;   //!< Peripheral Port Switch Register 2

/**
 * @brief system clock control interface
 * 
 */
struct SYSCLK_struct{
    __IO uint8_t RCC_CKSEL;
    __IO uint8_t RCC_CLKDIV;
    __IO uint8_t RCC_IRC24MCR;
    __IO uint8_t RCC_XOSCCR;
    __IO uint8_t RCC_IRC32KCR;
    __IO uint8_t RCC_MCLKOCR;
    __IO uint8_t RCC_IRCDB;
};
#define SYSCLK_TypeDef struct SYSCLK_struct

// * system clock special function register setting in internal expansion RAM 
/* internel oscillator frequency control and adjustment registers*/
#define     IRCBAND_ADDR                0x9D
#define     LIRTRIM_ADDR                0x9E
#define     IRTRIM_ADDR                 0x9F

/* Bit definition for IRCBAND register */
#define     IRCBAND_SEL                 0x03 /*!< SEL[1:0], IRC band selection */
#define     IRCBAND_SEL_0               0x01 /*!< Bit 0 */
#define     IRCBAND_SEL_1               0x02 /*!< Bit 1 */

#define     IRCBAND_SEL_6MHz            0x00
#define     IRCBAND_SEL_10MHz           0x01
#define     IRCBAND_SEL_27MHz           0x02
#define     IRCBAND_SEL_44MHz           0x03


/* Bit definition for LIRTRIM register */
#define     LIRTRIM_BIT                 0x01

/* Bit definition for IRTRIM register */
// user define the value from 0~255 for this register

sfr IRCBAND     =   IRCBAND_ADDR;   //! IRC band selection
sfr IRTRIM      =   IRTRIM_ADDR;    //! internal IRC frequency adjustment register
sfr LIRTRIM     =   LIRTRIM_ADDR;   //! internal IRC frequency subtle adjustment register

/* system clock base address */
#define     SYSCLK_BASE                 0xFE00

#define     CKSEL_ADDR                  (SYSCLK_BASE + 0x0000)
#define     CLKDIV_ADDR                 (SYSCLK_BASE + 0x0001)
#define     IRC24MCR_ADDR               (SYSCLK_BASE + 0x0002)
#define     XOSCCR_ADDR                 (SYSCLK_BASE + 0x0003)
#define     IRC32KCR_ADDR               (SYSCLK_BASE + 0x0004)
#define     MCLKOCR_ADDR                (SYSCLK_BASE + 0x0005)
#define     IRCDB_ADDR                  (SYSCLK_BASE + 0x0006)

/* Bit definition for CKSEL register */
// * MCKSEL configuration
#define     CKSEL_MCKSEL                0x03 /*!< MCLKODIV[1:0] bits (system clock output division coefficient) */
#define     CKSEL_MCKSEL_0              0x01 /*!< Bit 0 */
#define     CKSEL_MCKSEL_1              0x02 /*!< Bit 1 */

#define     CKSEL_MCKSEL_IRC24MCR       0x00 /*!< select internal 24MHz High accurate IRC */
#define     CKSEL_MCKSEL_XOSCCR_O       0x01 /*!< select outer clock input */
#define     CKSEL_MCKSEL_XOSCCR_C       0x02 /*!< select outer clock input */
#define     CKSEL_MCKSEL_IRC32KST       0x03 /*!< select internal 32kHz low speed IRC */

/* Bit definition for CLKDIV register */
// user define the value from 0~255 for this register. Maximum 0.55% per bit, minium 0.02% per bit, average 0.24% per bit

/* Bit definition for IRC24MCR register */
// * ENIRC24M configuration
#define     IRC24MCR_ENIRC24M           0x80 /*!< IRC24MCR enabling control */

// * IRC24MST configuration
#define     IRC24MCR_IRC24MST           0x01 /*!< IRC24MCR stable state flag */

/* Bit definition for XOSCCR register */
// * ENXOSC configuration
#define     XOSCCR_ENXOSC               0x80 /*!< external oscillator enabling control */

// * XITYPE configuration
#define     XOSCCR_XITYPE               0x40 /*!< external oscillator type selection */

// * XOSCST configuration
#define     XOSCCR_XOSCST               0x01 /*!< external oscillator stable state flag */

// * XCFILTER configuration
#define     XOSCCR_XCFILTER             0x30 /*!< XCFILTER[1:0], External Crystal Oscillator anti-interference control register */
#define     XOSCCR_XCFILTER_0           0x10 /*!< BIT 0 */
#define     XOSCCR_XCFILTER_1           0x20 /*!< BIT 1 */

#define     XOSCCR_XCFILTER_48M_LOWER   0x00 /*!< Select if the external Crystal oscillator frequency is 48M or below */
#define     XOSCCR_XCFILTER_24M_LOWER   0x10 /*!< Select if the external Crystal oscillator frequency is 24M or below */
#define     XOSCCR_XCFILTER_12M_LOWER   0x20 /*!< Select if the external Crystal oscillator frequency is 12M or below */

