HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8hx.h
// * NMXCG configuration
#define     XOSCCR_NMXCG                0x08 /*!< External Crystal oscillator gain control: [0], Low gain; [1], High gain */

/* Bit definition for IRC32KCR register */
// * ENIRC32K configuration
#define     IRC32KCR_ENIRC32K           0x80 /*!< IRC32KCR enabling control */

// * IRC32KST configuration
#define     IRC32KCR_IRC32KST           0x01 /*!< IRC32KCR stable state flag */

/* Bit definition for MCLKOCR register */
#define     MCLKOCR_MCLKODIV            0x7F /*!< MCLKODIV[6:0] bits (main clock output division coefficient) */
#define     MCLKOCR_MCLKODIV_0          0x01 /*!< Bit 0 */
#define     MCLKOCR_MCLKODIV_1          0x02 /*!< Bit 1 */
#define     MCLKOCR_MCLKODIV_2          0x04 /*!< Bit 2 */
#define     MCLKOCR_MCLKODIV_3          0x08 /*!< Bit 3 */
#define     MCLKOCR_MCLKODIV_4          0x10 /*!< Bit 4 */
#define     MCLKOCR_MCLKODIV_5          0x20 /*!< Bit 5 */
#define     MCLKOCR_MCLKODIV_6          0x40 /*!< Bit 6 */

// MCLKO_S configuration
#define     MCLKOCR_MCLKO_S             0x08 /*!< divided MCLK output pin: [0] P5.4; [1] P1.6 */

/**
 * @brief define the SYSCLK type
 * @note To access XDATA peripherals, use the \c volatile keyword to ensure 
 * that the C compiler does not optimize out necessary memory accesses.
 */
#define     SYSCLK          ((SYSCLK_TypeDef xdata *) SYSCLK_BASE)

#define     CKSEL           (*(__IO uint8_t xdata *)   CKSEL_ADDR)     //!< system clock selection
#define     CLKDIV          (*(__IO uint8_t xdata *)   CLKDIV_ADDR)    //!< system clock division
#define     IRC24MCR        (*(__IO uint8_t xdata *)   IRC24MCR_ADDR)  //!< internal 24MHz oscillator control
#define     XOSCCR          (*(__IO uint8_t xdata *)   XOSCCR_ADDR)    //!< external oscillator control
#define     IRC32KCR        (*(__IO uint8_t xdata *)   IRC32KCR_ADDR)  //!< internal 32kHz oscillator control
#define     MCLKOCR         (*(__IO uint8_t xdata *)   MCLKOCR_ADDR)   //!< Master Clock Output Control Register
#define     IRCDB           (*(__IO uint8_t xdata *)   IRCDB_ADDR)     //!< Internal IRC start-up shake-out control


//! system power special function register setting
/* power control base address */
#define     PCON_ADDR                   0x87
#define     VOCTRL_ADDR                 0xBB

/* Bit definition for PCON register */
// * LVDF configuration
#define     PCON_LVDF                   0x20     /*!< low voltage check flag bit */

// * POF configuration
#define     PCON_POF                    0x10     /*!< Power-on reset flag bit */

// * PD configuration
#define     PCON_PD                     0x02     /*!< peripherals stopping mode control bit */

// * IDL configuration
#define     PCON_IDL                    0x01     /*!< peripherals IDLE mode control bit */

/* Bit definition for VOCTRL register */
// * SCC configuration
#define     VOCTRL_SCC                   0x80     /*!< static current control bit: [0] internal circuit 1.5uA; [1] external circuit lower than 0.15uA */

sfr PCON        =   PCON_ADDR;          //! power source control register
sfr VOCTRL      =   VOCTRL_ADDR;        //! voltage level control register

//! system reset special function register control
/* reset control base address */
#define     WDT_CONTR_ADDR              0xC1
// #define     IAP_ADDR      0xC7u
#define     RSTCFG_ADDR                 0xFF

/* Bit definition for WDT_CONTR register */
// * WDT_FLAG configuration
#define     WDT_CONTR_WDT_FLAG          0x80     /*!< Watch dog overflow flag */

// * EN_WDT configuration
#define     WDT_CONTR_EN_WDT            0x20     /*!< Watch dog enabling bit: [0] off; [1] on */

// * CLR_WDT configuration
#define     WDT_CONTR_CLR_WDT           0x10     /*!< Watch dog timer auto clearance by firmware: [0] off; [1] on */

// * IDL_WDT configuration
#define     WDT_CONTR_IDL_WDT           0x08     /*!< Watch dog counting function control on IDLE model [0] stop; [1] resume */

// * WDT_PS configuration
#define     WDT_CONTR_WDT_PS            0x07     /*!< WDT_PS[2:0] bits (watch dog timer clock division coefficient) */
#define     WDT_CONTR_WDT_PS0           0x01     /*!< Bit 0 */
#define     WDT_CONTR_WDT_PS1           0x02     /*!< Bit 1 */
#define     WDT_CONTR_WDT_PS2           0x04     /*!< Bit 2 */

/**
 * @note  watch dog overflow time = (12x32768x2^(WDT_PS+1))/SYSCLK
 */
#define     WDT_CONTR_WDT_PS_DIV2       0x00     /*!< Watch dog input clock divided by 2 */
#define     WDT_CONTR_WDT_PS_DIV4       0x01     /*!< Watch dog input clock divided by 4 */
#define     WDT_CONTR_WDT_PS_DIV8       0x02     /*!< Watch dog input clock divided by 8 */
#define     WDT_CONTR_WDT_PS_DIV16      0x03     /*!< Watch dog input clock divided by 16 */
#define     WDT_CONTR_WDT_PS_DIV32      0x04     /*!< Watch dog input clock divided by 32 */
#define     WDT_CONTR_WDT_PS_DIV64      0x05     /*!< Watch dog input clock divided by 64 */
#define     WDT_CONTR_WDT_PS_DIV128     0x06     /*!< Watch dog input clock divided by 128 */
#define     WDT_CONTR_WDT_PS_DIV256     0x07     /*!< Watch dog input clock divided by 256 */

/* Bit definition for RSTCFG register */
// * ENLVR configuration
#define     RSTCFG_ENLVR                0x40     /*!< low voltage reset control bit */

// * P54RST configuration
#define     RSTCFG_P54RST               0x10     /*!< RST pin selection: [0] regard P5.4 as normal pin; [1]: regard P5.4 as RST */

// * LVDS configuration
#define     RSTCFG_LVDS                 0x03     /*!< WDT_PS[1:0] bits, low voltage threshold selection */
#define     RSTCFG_LVDS_0               0x01     /*!< Bit 0 */
#define     RSTCFG_LVDS_1               0x02     /*!< Bit 1 */

#define     RSTCFG_LVDS_2V2             0x00     /*!< low voltage threshold 2.2V */
#define     RSTCFG_LVDS_2V4             0x01     /*!< low voltage threshold 2.4V */
#define     RSTCFG_LVDS_2V7             0x02     /*!< low voltage threshold 2.7V */
#define     RSTCFG_LVDS_3V0             0x03     /*!< low voltage threshold 3.0V */

sfr WDT_CONTR   =   WDT_CONTR_ADDR;     //! Watch dog control register
// sfr IAP_CONTR   =   IAP_ADDR;
sfr RSTCFG      =   RSTCFG_ADDR;        //! Reset configuration register

/* wake up timer base address */
#define     WKTCL_ADDR                  0xAA
#define     WKTCH_ADDR                  0xAB

