HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8hx.h
/* WKTCH offset */
#define WKTEN       0x80

sfr WKTCL       =   WKTCL_ADDR;         //! Power down wake up timer low bytes
sfr WKTCH       =   WKTCH_ADDR;         //! Power down wake up timer high bytes

//! GPIO peripherals
#define     GPIO_BASE       0x80
#define     PxM0_BASE       0x94
#define     PxM1_BASE       0x93
#define     PxPU_BASE       0xFE10
#define     PxNCS_BASE      0xFE18
#define     PxSR_BASE       0xFE20
#define     PxDR_BASE       0xFE28
#define     PxIE_BASE       0xFE30


/* GPIO address definition */
#define     P0_ADDR         GPIO_BASE
#define     P1_ADDR         0x90
#define     P2_ADDR         0xA0
#define     P3_ADDR         0xB0
#define     P4_ADDR         0xC0
#define     P5_ADDR         0xC8
#define     P6_ADDR         0xE8
#define     P7_ADDR         0xF8

/* PxM0: GPIO configuration registers 0 address definition */
#define     P0M0_ADDR       PxM0_BASE 
#define     P1M0_ADDR       0x92
#define     P2M0_ADDR       0x96
#define     P3M0_ADDR       0xB2
#define     P4M0_ADDR       0xB4
#define     P5M0_ADDR       0xCA
#define     P6M0_ADDR       0xCC
#define     P7M0_ADDR       0xE2

/* PxM1: GPIO configuration registers 1 address definition */
#define     P0M1_ADDR       PxM1_BASE 
#define     P1M1_ADDR       0x91
#define     P2M1_ADDR       0x95
#define     P3M1_ADDR       0xB1
#define     P4M1_ADDR       0xB3
#define     P5M1_ADDR       0xC9
#define     P6M1_ADDR       0xCB
#define     P7M1_ADDR       0xE1

/* GPIO pull up resistor control register address definition */
#define     P0PU_ADDR        (PxPU_BASE + 0x00)
#define     P1PU_ADDR        (PxPU_BASE + 0x01)
#define     P2PU_ADDR        (PxPU_BASE + 0x02)
#define     P3PU_ADDR        (PxPU_BASE + 0x03)
#define     P4PU_ADDR        (PxPU_BASE + 0x04)
#define     P5PU_ADDR        (PxPU_BASE + 0x05)
#define     P6PU_ADDR        (PxPU_BASE + 0x06)
#define     P7PU_ADDR        (PxPU_BASE + 0x07)

/*GPIO schmidt trigger control register address definition */

#define     P0NCS_ADDR       (PxNCS_BASE + 0x00)
#define     P1NCS_ADDR       (PxNCS_BASE + 0x01)
#define     P2NCS_ADDR       (PxNCS_BASE + 0x02)
#define     P3NCS_ADDR       (PxNCS_BASE + 0x03)
#define     P4NCS_ADDR       (PxNCS_BASE + 0x04)
#define     P5NCS_ADDR       (PxNCS_BASE + 0x05)
#define     P6NCS_ADDR       (PxNCS_BASE + 0x06)
#define     P7NCS_ADDR       (PxNCS_BASE + 0x07)

/* Register level conversion rate Address */
#define     P0SR_ADDR       (PxSR_BASE + 0x00)
#define     P1SR_ADDR       (PxSR_BASE + 0x01)
#define     P2SR_ADDR       (PxSR_BASE + 0x02)
#define     P3SR_ADDR       (PxSR_BASE + 0x03)
#define     P4SR_ADDR       (PxSR_BASE + 0x04)
#define     P5SR_ADDR       (PxSR_BASE + 0x05)
#define     P6SR_ADDR       (PxSR_BASE + 0x06)
#define     P7SR_ADDR       (PxSR_BASE + 0x07)

/* Drive current control register Address */
#define     P0DR_ADDR       (PxDR_BASE + 0x00)
#define     P1DR_ADDR       (PxDR_BASE + 0x01)
#define     P2DR_ADDR       (PxDR_BASE + 0x02)
#define     P3DR_ADDR       (PxDR_BASE + 0x03)
#define     P4DR_ADDR       (PxDR_BASE + 0x04)
#define     P5DR_ADDR       (PxDR_BASE + 0x05)
#define     P6DR_ADDR       (PxDR_BASE + 0x06)
#define     P7DR_ADDR       (PxDR_BASE + 0x07)

/* Input enable control register Address */
#define     P0IE_ADDR       (PxIE_BASE + 0x00)
#define     P1IE_ADDR       (PxIE_BASE + 0x01)
#define     P2IE_ADDR       (PxIE_BASE + 0x02)
#define     P3IE_ADDR       (PxIE_BASE + 0x03)
#define     P4IE_ADDR       (PxIE_BASE + 0x04)
#define     P5IE_ADDR       (PxIE_BASE + 0x05)
#define     P6IE_ADDR       (PxIE_BASE + 0x06)
#define     P7IE_ADDR       (PxIE_BASE + 0x07)

// I/O ISR registers
#define     PxINTE_BASE     0xFD00
#define     PxINTF_BASE     0xFD10
#define     PxIM0_BASE      0xFD20
#define     PxIM1_BASE      0xFD30
#define     PxWKUE_BASE     0xFD40

#define     PINIPL_ADDR     0xFD60
#define     PINIPH_ADDR     0xFD61

/* PxINTE address definition */
#define     P0INTE_ADDR     (PxINTE_BASE + 0x0000)
#define     P1INTE_ADDR     (PxINTE_BASE + 0x0001)
#define     P2INTE_ADDR     (PxINTE_BASE + 0x0002)
#define     P3INTE_ADDR     (PxINTE_BASE + 0x0003)
#define     P4INTE_ADDR     (PxINTE_BASE + 0x0004)
#define     P5INTE_ADDR     (PxINTE_BASE + 0x0005)
#define     P6INTE_ADDR     (PxINTE_BASE + 0x0006)
#define     P7INTE_ADDR     (PxINTE_BASE + 0x0007)

/* PxINTF address definition */
#define     P0INTF_ADDR     (PxINTF_BASE + 0x0000)
#define     P1INTF_ADDR     (PxINTF_BASE + 0x0001)
#define     P2INTF_ADDR     (PxINTF_BASE + 0x0002)
#define     P3INTF_ADDR     (PxINTF_BASE + 0x0003)
#define     P4INTF_ADDR     (PxINTF_BASE + 0x0004)
#define     P5INTF_ADDR     (PxINTF_BASE + 0x0005)
#define     P6INTF_ADDR     (PxINTF_BASE + 0x0006)
#define     P7INTF_ADDR     (PxINTF_BASE + 0x0007)

/* PxIM0 address definition */
#define     P0IM0_ADDR      (PxIM0_BASE + 0x0000)
#define     P1IM0_ADDR      (PxIM0_BASE + 0x0001)
#define     P2IM0_ADDR      (PxIM0_BASE + 0x0002)
#define     P3IM0_ADDR      (PxIM0_BASE + 0x0003)
#define     P4IM0_ADDR      (PxIM0_BASE + 0x0004)
#define     P5IM0_ADDR      (PxIM0_BASE + 0x0005)
#define     P6IM0_ADDR      (PxIM0_BASE + 0x0006)
#define     P7IM0_ADDR      (PxIM0_BASE + 0x0007)

/* PxIM1 address definition */
#define     P0IM1_ADDR      (PxIM1_BASE + 0x0000)
#define     P1IM1_ADDR      (PxIM1_BASE + 0x0001)
#define     P2IM1_ADDR      (PxIM1_BASE + 0x0002)
#define     P3IM1_ADDR      (PxIM1_BASE + 0x0003)
#define     P4IM1_ADDR      (PxIM1_BASE + 0x0004)
#define     P5IM1_ADDR      (PxIM1_BASE + 0x0005)
#define     P6IM1_ADDR      (PxIM1_BASE + 0x0006)
#define     P7IM1_ADDR      (PxIM1_BASE + 0x0007)

/* PxIM1 address definition */
#define     P0WKUE_ADDR     (PxWKUE_BASE + 0x0000)
#define     P1WKUE_ADDR     (PxWKUE_BASE + 0x0001)
#define     P2WKUE_ADDR     (PxWKUE_BASE + 0x0002)
#define     P3WKUE_ADDR     (PxWKUE_BASE + 0x0003)
#define     P4WKUE_ADDR     (PxWKUE_BASE + 0x0004)
#define     P5WKUE_ADDR     (PxWKUE_BASE + 0x0005)
#define     P6WKUE_ADDR     (PxWKUE_BASE + 0x0006)
#define     P7WKUE_ADDR     (PxWKUE_BASE + 0x0007)

//* Px port interrupt enabling registers: [0] off; [1] on */
#define     P0INTE          (*(__IO uint8_t xdata *) P0INTE_ADDR)
#define     P1INTE          (*(__IO uint8_t xdata *) P1INTE_ADDR)
#define     P2INTE          (*(__IO uint8_t xdata *) P2INTE_ADDR)
#define     P3INTE          (*(__IO uint8_t xdata *) P3INTE_ADDR)
#define     P4INTE          (*(__IO uint8_t xdata *) P4INTE_ADDR)
#define     P5INTE          (*(__IO uint8_t xdata *) P5INTE_ADDR)
#define     P6INTE          (*(__IO uint8_t xdata *) P6INTE_ADDR)
#define     P7INTE          (*(__IO uint8_t xdata *) P7INTE_ADDR)

//* Px port interrupt flag registers: [0] no interrupt request; [1] interrupt requeset, if interrupt is enabled, program will run into interrupt. Software clearance is */
#define     P0INTF          (*(__IO uint8_t xdata *) P0INTF_ADDR)
#define     P1INTF          (*(__IO uint8_t xdata *) P1INTF_ADDR)
#define     P2INTF          (*(__IO uint8_t xdata *) P2INTF_ADDR)
#define     P3INTF          (*(__IO uint8_t xdata *) P3INTF_ADDR)
#define     P4INTF          (*(__IO uint8_t xdata *) P4INTF_ADDR)
#define     P5INTF          (*(__IO uint8_t xdata *) P5INTF_ADDR)
#define     P6INTF          (*(__IO uint8_t xdata *) P6INTF_ADDR)
#define     P7INTF          (*(__IO uint8_t xdata *) P7INTF_ADDR)

/**
 * @note GPIO interrupt mode selection
 * \verbatim 
 * | PnIM1.x | PnIM0.x | Pn.x interrupt mode |
 * |    0    |    0    |     falling edge    |
 * |    0    |    1    |     rising edge     |
 * |    1    |    0    |  low elertic level  |
 * |    1    |    1    |  high elertic level |
 * \endverbatim
 */ 
//* Px port interrupt mode registers 0 */
#define     P0IM0           (*(__IO uint8_t xdata *) P0IM0_ADDR)
#define     P1IM0           (*(__IO uint8_t xdata *) P1IM0_ADDR)
#define     P2IM0           (*(__IO uint8_t xdata *) P2IM0_ADDR)
#define     P3IM0           (*(__IO uint8_t xdata *) P3IM0_ADDR)
#define     P4IM0           (*(__IO uint8_t xdata *) P4IM0_ADDR)
#define     P5IM0           (*(__IO uint8_t xdata *) P5IM0_ADDR)
#define     P6IM0           (*(__IO uint8_t xdata *) P6IM0_ADDR)
#define     P7IM0           (*(__IO uint8_t xdata *) P7IM0_ADDR)

//* Px port interrupt mode registers 1 */
#define     P0IM1           (*(__IO uint8_t xdata *) P0IM1_ADDR)
#define     P1IM1           (*(__IO uint8_t xdata *) P1IM1_ADDR)
#define     P2IM1           (*(__IO uint8_t xdata *) P2IM1_ADDR)
#define     P3IM1           (*(__IO uint8_t xdata *) P3IM1_ADDR)
#define     P4IM1           (*(__IO uint8_t xdata *) P4IM1_ADDR)
#define     P5IM1           (*(__IO uint8_t xdata *) P5IM1_ADDR)
#define     P6IM1           (*(__IO uint8_t xdata *) P6IM1_ADDR)
#define     P7IM1           (*(__IO uint8_t xdata *) P7IM1_ADDR)

//* Px port interrupt wake up enabling registers: [0] off; [1] on */
#define     P0WKUE          (*(__IO uint8_t xdata *) P0WKUE_ADDR)
#define     P1WKUE          (*(__IO uint8_t xdata *) P1WKUE_ADDR)
#define     P2WKUE          (*(__IO uint8_t xdata *) P2WKUE_ADDR)
#define     P3WKUE          (*(__IO uint8_t xdata *) P3WKUE_ADDR)
#define     P4WKUE          (*(__IO uint8_t xdata *) P4WKUE_ADDR)
#define     P5WKUE          (*(__IO uint8_t xdata *) P5WKUE_ADDR)
#define     P6WKUE          (*(__IO uint8_t xdata *) P6WKUE_ADDR)
#define     P7WKUE          (*(__IO uint8_t xdata *) P7WKUE_ADDR)

// PxIPH,PxIP: [00] lowest; [01] low; [10] high; [11] highest 
//* I/O interrupt priority registers Low/High */
#define     PINIPL          (*(__IO uint8_t xdata *) PINIPL_ADDR)
#define     PINIPH          (*(__IO uint8_t xdata *) PINIPH_ADDR)

/* GPIO registers configuration */
sfr P0          =   P0_ADDR;
sfr P1          =   P1_ADDR;
sfr P2          =   P2_ADDR;
sfr P3          =   P3_ADDR;
sfr P4          =   P4_ADDR;
sfr P5          =   P5_ADDR;
sfr P6          =   P6_ADDR;
sfr P7          =   P7_ADDR;

/**
 * @note GPIO mode selection
 * \verbatim 
 * | PnM1.x | PnM0.x |         Pn.x Mode         |
 * |   0    |   0    | quasi- bidirectional port | ([weak pull up] up to 20mA constant-current; pull current between 150~270uA)
 * |   0    |   1    |      push-pul output      | ([strong pull up] up to 20mA contant-current; current-limited resistor is needed)
 * |   1    |   0    |   high impedance output   | (no current)
 * |   1    |   1    |     open drain output     | (internal pull up resistor disconnected; external pull up resistor is needed)
 * \endverbatim
 */

/* Bit definition for GPIO control registers */
/* GPIO configuration registers 0 */
sfr P0M0        =   P0M0_ADDR;
sfr P1M0        =   P1M0_ADDR;
sfr P2M0        =   P2M0_ADDR;
sfr P3M0        =   P3M0_ADDR;
sfr P4M0        =   P4M0_ADDR;
sfr P5M0        =   P5M0_ADDR;
sfr P6M0        =   P6M0_ADDR;
sfr P7M0        =   P7M0_ADDR;

/* GPIO configuration registers 1 */
sfr P0M1        =   P0M1_ADDR;
sfr P1M1        =   P1M1_ADDR;
sfr P2M1        =   P2M1_ADDR;
sfr P3M1        =   P3M1_ADDR;
sfr P4M1        =   P4M1_ADDR;
sfr P5M1        =   P5M1_ADDR;
sfr P6M1        =   P6M1_ADDR;
sfr P7M1        =   P7M1_ADDR;

/* Bit definition for GPIO pins */
sbit P00        =   P0^0;
sbit P01        =   P0^1;
sbit P02        =   P0^2;
sbit P03        =   P0^3;
sbit P04        =   P0^4;
sbit P05        =   P0^5;
sbit P06        =   P0^6;
sbit P07        =   P0^7;
sbit P10        =   P1^0;
sbit P11        =   P1^1;
sbit P12        =   P1^2;
sbit P13        =   P1^3;
sbit P14        =   P1^4;
sbit P15        =   P1^5;
sbit P16        =   P1^6;
sbit P17        =   P1^7;
sbit P20        =   P2^0;
sbit P21        =   P2^1;
sbit P22        =   P2^2;
sbit P23        =   P2^3;
sbit P24        =   P2^4;
sbit P25        =   P2^5;
sbit P26        =   P2^6;
sbit P27        =   P2^7;
sbit P30        =   P3^0;
sbit P31        =   P3^1;
sbit P32        =   P3^2;
sbit P33        =   P3^3;
sbit P34        =   P3^4;
sbit P35        =   P3^5;
sbit P36        =   P3^6;
sbit P37        =   P3^7;
sbit P40        =   P4^0;
sbit P41        =   P4^1;
sbit P42        =   P4^2;
sbit P43        =   P4^3;
sbit P44        =   P4^4;
sbit P45        =   P4^5;
sbit P46        =   P4^6;
sbit P47        =   P4^7;
sbit P50        =   P5^0;
sbit P51        =   P5^1;
sbit P52        =   P5^2;
sbit P53        =   P5^3;
sbit P54        =   P5^4;
sbit P55        =   P5^5;
sbit P56        =   P5^6;
sbit P57        =   P5^7;
sbit P60        =   P6^0;
sbit P61        =   P6^1;
sbit P62        =   P6^2;
sbit P63        =   P6^3;
sbit P64        =   P6^4;
sbit P65        =   P6^5;
sbit P66        =   P6^6;
sbit P67        =   P6^7;
sbit P70        =   P7^0;
sbit P71        =   P7^1;
sbit P72        =   P7^2;
sbit P73        =   P7^3;
sbit P74        =   P7^4;
sbit P75        =   P7^5;
sbit P76        =   P7^6;
sbit P77        =   P7^7;

