HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8hx.h
// * GPIO pull up resistor control registers: [0] off; [1] on*/
#define     P0PU        (*(__IO uint8_t xdata *) P0PU_ADDR)             // Extended SFR
#define     P1PU        (*(__IO uint8_t xdata *) P1PU_ADDR)             // Extended SFR
#define     P2PU        (*(__IO uint8_t xdata *) P2PU_ADDR)             // Extended SFR
#define     P3PU        (*(__IO uint8_t xdata *) P3PU_ADDR)             // Extended SFR
#define     P4PU        (*(__IO uint8_t xdata *) P4PU_ADDR)             // Extended SFR
#define     P5PU        (*(__IO uint8_t xdata *) P5PU_ADDR)             // Extended SFR
#define     P6PU        (*(__IO uint8_t xdata *) P6PU_ADDR)             // Extended SFR
#define     P7PU        (*(__IO uint8_t xdata *) P7PU_ADDR)             // Extended SFR

// * GPIO Schmitt trigger control registers: [0] off; [1] on */
#define     P0NCS       (*(__IO uint8_t xdata *) P0NCS_ADDR)            // Extended SFR
#define     P1NCS       (*(__IO uint8_t xdata *) P1NCS_ADDR)            // Extended SFR
#define     P2NCS       (*(__IO uint8_t xdata *) P2NCS_ADDR)            // Extended SFR
#define     P3NCS       (*(__IO uint8_t xdata *) P3NCS_ADDR)            // Extended SFR
#define     P4NCS       (*(__IO uint8_t xdata *) P4NCS_ADDR)            // Extended SFR
#define     P5NCS       (*(__IO uint8_t xdata *) P5NCS_ADDR)            // Extended SFR
#define     P6NCS       (*(__IO uint8_t xdata *) P6NCS_ADDR)            // Extended SFR
#define     P7NCS       (*(__IO uint8_t xdata *) P7NCS_ADDR)            // Extended SFR

/* Register level conversion rate: [0] fast; [1] slow */
#define     P0SR        (*(__IO uint8_t xdata *) P0SR_ADDR)            // Extended SFR
#define     P1SR        (*(__IO uint8_t xdata *) P1SR_ADDR)            // Extended SFR
#define     P2SR        (*(__IO uint8_t xdata *) P2SR_ADDR)            // Extended SFR
#define     P3SR        (*(__IO uint8_t xdata *) P3SR_ADDR)            // Extended SFR
#define     P4SR        (*(__IO uint8_t xdata *) P4SR_ADDR)            // Extended SFR
#define     P5SR        (*(__IO uint8_t xdata *) P5SR_ADDR)            // Extended SFR
#define     P6SR        (*(__IO uint8_t xdata *) P6SR_ADDR)            // Extended SFR
#define     P7SR        (*(__IO uint8_t xdata *) P7SR_ADDR)            // Extended SFR
/* Drive current control register Address: [0] enhanced; [1] normal */
#define     P0DR        (*(__IO uint8_t xdata *) P0DR_ADDR)            // Extended SFR
#define     P1DR        (*(__IO uint8_t xdata *) P1DR_ADDR)            // Extended SFR
#define     P2DR        (*(__IO uint8_t xdata *) P2DR_ADDR)            // Extended SFR
#define     P3DR        (*(__IO uint8_t xdata *) P3DR_ADDR)            // Extended SFR
#define     P4DR        (*(__IO uint8_t xdata *) P4DR_ADDR)            // Extended SFR
#define     P5DR        (*(__IO uint8_t xdata *) P5DR_ADDR)            // Extended SFR
#define     P6DR        (*(__IO uint8_t xdata *) P6DR_ADDR)            // Extended SFR
#define     P7DR        (*(__IO uint8_t xdata *) P7DR_ADDR)            // Extended SFR
/* Input enable control register Address: [0] disable digital signal input; [1]  enable digital signal input */
#define     P0IE       (*(__IO uint8_t xdata *) P0IE_ADDR)            // Extended SFR
#define     P1IE       (*(__IO uint8_t xdata *) P1IE_ADDR)            // Extended SFR
#define     P2IE       (*(__IO uint8_t xdata *) P2IE_ADDR)            // Extended SFR
#define     P3IE       (*(__IO uint8_t xdata *) P3IE_ADDR)            // Extended SFR
#define     P4IE       (*(__IO uint8_t xdata *) P4IE_ADDR)            // Extended SFR
#define     P5IE       (*(__IO uint8_t xdata *) P5IE_ADDR)            // Extended SFR
#define     P6IE       (*(__IO uint8_t xdata *) P6IE_ADDR)            // Extended SFR
#define     P7IE       (*(__IO uint8_t xdata *) P7IE_ADDR)            // Extended SFR



#define GPIO_Px(x)  (P##x)
#define Px_M1(x)    (P##x##M1)
#define Px_M0(x)    (P##x##M0)
#define Px_PU(x)    (P##x##PU)
#define Px_SR(x)    (P##x##SR)
#define Px_DR(x)    (P##x##DR)
#define Px_IE(x)    (P##x##IE)
#define Px_NCS(x)   (P##x##NCS)

#define Px_INTE(x)  (P##x##INTE)
#define Px_INTF(x)  (P##x##INTF)
#define Px_IM0(x)   (P##x##IM0)
#define Px_IM1(x)   (P##x##IM1)
#define Px_WKUE(x)  (P##x##WKUE)


//! ISR peripherals
/* ISR basic address definition */
#define    IE_ADDR          0xA8
#define    IE2_ADDR         0xAF

#define    IP_ADDR          0xB8
#define    IPH_ADDR         0xB7
#define    IP2_ADDR         0xB5
#define    IP2H_ADDR        0xB6
#define    IP3_ADDR         0xDF
#define    IP3H_ADDR        0xEE

#define    INTCLKO_ADDR     0x8F
#define    AUXINTIF_ADDR    0xEF

/* Bit definition for IE2 registers [0] off; [1] on */
#define     IE2_ET4         0x40             /*!< Timer T4 overflow interrupt enabling bit */
#define     IE2_ET3         0x20             /*!< Timer T3 overflow interrupt enabling bit */
#define     IE2_ES4         0x10             /*!< serial port S4 interrupt enabling bit */
#define     IE2_ES3         0x08             /*!< serial port S3 interrupt enabling bit */
#define     IE2_ET2         0x04             /*!< Timer T2 overflow interrupt enabling bit */
#define     IE2_ESPI        0x02             /*!< SPI interrupt enabling bit */
#define     IE2_ES2         0x01             /*!< serial port S2 interrupt enabling bit */

/* Bit definition for IP registers */
#define     IP_PPCA         0x80
#define     IP_PLVD         0x40
#define     IP_PADC         0x20
#define     IP_PS           0x10
#define     IP_PT1          0x08
#define     IP_PX1          0x04
#define     IP_PT0          0x02
#define     IP_PX0          0x01

/* Bit definition for IPH registers */
#define     IPH_PPCAH       0x80
#define     IPH_PLVDH       0x40
#define     IPH_PADCH       0x20
#define     IPH_PSH         0x10
#define     IPH_PT1H        0x08
#define     IPH_PX1H        0x04
#define     IPH_PT0H        0x02
#define     IPH_PX0H        0x01

/* Bit definition for IP2 registers */
#define     IP2_PI2C        0x40
#define     IP2_PCMP        0x20
#define     IP2_PX4         0x10
#define     IP2_PPWMFD      0x08
#define     IP2_PPWM        0x04
#define     IP2_PSPI        0x02
#define     IP2_PS2         0x01

