HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8hx.h
/* Bit definition for IP2H registers */
#define     IP2H_PI2CH      0x40
#define     IP2H_PCMPH      0x20
#define     IP2H_PX4H       0x10
#define     IP2H_PPWMFDH    0x08
#define     IP2H_PPWMH      0x04
#define     IP2H_PSPIH      0x02
#define     IP2H_PS2H       0x01

/* Bit definition for IP3 registers */
#define     IP3_PS4         0x02
#define     IP3_PS3         0x01

/* Bit definition for IP3H registers */
#define     IP3H_PS4        0x02
#define     IP3H_PS3        0x01

/* Bit definition for INTCLKO registers */
#define     INTCLKO_EX4     0x40             /*!< external interrupt 4 interrupt enabling flag */
#define     INTCLKO_EX3     0x20             /*!< external interrupt 3 interrupt enabling flag */
#define     INTCLKO_EX2     0x10             /*!< external interrupt 2 interrupt enabling flag */
#define     INTCLKO_T2CLKO  0x04


/* Bit definition for AUXINTIF registers */
#define     AUXINTIF_INT4IF 0x40             /*!< external interrupt 4 interrupt request flag */
#define     AUXINTIF_INT3IF 0x20             /*!< external interrupt 3 interrupt request flag */
#define     AUXINTIF_INT2IF 0x10             /*!< external interrupt 2 interrupt request flag */
#define     AUXINTIF_T4IF   0x04             /*!< timer 4 overflow interrupt request flag */
#define     AUXINTIF_T3IF   0x02             /*!< timer 3 overflow interrupt request flag */
#define     AUXINTIF_T2IF   0x01             /*!< timer 2 overflow interrupt request flag */

/* ISR special function register */
sfr IE          =   IE_ADDR;                            //! interrupt enabling register
sfr IE2         =   IE2_ADDR;                           //! interrupt enabling register 2
sfr IP          =   IP_ADDR;                            //! interrupt priority control register IP
sfr IP2         =   IP2_ADDR;                           //! interrupt priority control register IP2
sfr IP3         =   IP3_ADDR;                           //! interrupt priority control register IP3
sfr IPH         =   IPH_ADDR;                           //! interrupt priority control register IPH
sfr IP2H        =   IP2H_ADDR;                          //! interrupt priority control register IP2H
sfr IP3H        =   IP3H_ADDR;                          //! interrupt priority control register IP3H
sfr INTCLKO     =   INTCLKO_ADDR;                       //! external interrupt and clock output control registers
sfr AUXINTIF    =   AUXINTIF_ADDR;                      //! interrupt flag auxiliary register


/* Bit definition for IE register (interrupt enabling register) */ 
sbit EA      =   IE^7;                               /*!< totoal interrupt enabling control bit */
sbit ELVD    =   IE^6;                               /*!< low voltage check interrupt enabling control bit */
sbit EADC    =   IE^5;                               /*!< A/D convertion interrupt enabling control bit */
sbit ES      =   IE^4;                               /*!< serial port 1 interrupt enabling control bit */
sbit ET1     =   IE^3;                               /*!< timer T1 overflow interrupt enabling control bit */
sbit EX1     =   IE^2;                               /*!< external interrupt 1 interrupt enabling control bit */
sbit ET0     =   IE^1;                               /*!< timer T0 interrupt enabling control bit */
sbit EX0     =   IE^0;                               /*!< external interrupt 0 interrupt enabling control bit */

/* Bit definition for IP register */
sbit PPCA       =   IP^7;
sbit PLVD       =   IP^6;
sbit PADC       =   IP^5;
sbit PS         =   IP^4;
sbit PT1        =   IP^3;
sbit PX1        =   IP^2;
sbit PT0        =   IP^1;
sbit PX0        =   IP^0;

//! Timer peripherals
/* timer basic address definition */
#define     Timer_BASE      0x88
#define     TCON_ADDR       0x88
#define     TMOD_ADDR       0x89
#define     TL0_ADDR        0x8A
#define     TL1_ADDR        0x8B
#define     TH0_ADDR        0x8C
#define     TH1_ADDR        0x8D

#define     T2T3T4_BASE     0xD1
#define     T4T3M_ADDR      0xD1
#define     T4H_ADDR        0xD2
#define     T4L_ADDR        0xD3
#define     T3H_ADDR        0xD4
#define     T3L_ADDR        0xD5
#define     T2H_ADDR        0xD6
#define     T2L_ADDR        0xD7

#define     TM2PS_ADDR      0xFEA2
#define     TM3PS_ADDR      0xFEA3
#define     TM4PS_ADDR      0xFEA4

/* Bit definition for TMOD register */
#define     TMOD_T1_GATE    0x80        /*!< Timer/Counter T1 control. T1 works when TR1=1 and INT1 is high. */
#define     TMOD_T1_CT      0x40        /*!< Timer/Counter T1 function selection: [0] timer-internal SYSCLK input; [1] counter-P3.5 input */

#define     TMOD_T1_SEL     0x30        /*!< Mode selection [1:0] (decided by M1 and M0) */
#define     TMOD_T1_M1      0x20        /*!< BIT [1] */
#define     TMOD_T1_M0      0x10        /*!< BIT [0] */

#define     TMOD_T1_SEL_16B_AUTO_RELOAD             0x00     /*!< 16 bits auto reload mode. When T1 overflowing, T1 reload [TH1, TL1] */
#define     TMOD_T1_SEL_16B_REPEATED                0x10     /*!< 16 bits repeated mode. When T1 overflowing, T1 starts from 0. */
#define     TMOD_T1_SEL_8B_AUTO_RELOAD              0x20     /*!< 8 bits auto reload mode. When T1 overflowing, T1 reload [TL1] with [TH1]. */
#define     TMOD_T1_SEL_STOP                        0x30     /*!< T1 stop working */


#define     TMOD_T0_GATE    0x08        /*!< Timer T0 control. T1 works when TR1=1 and INT1 is high. */
#define     TMOD_T0_CT      0x04        /*!< Timer/Counter T1 function selection: [0] timer-internal SYSCLK input; [1] counter-P3.4 input */

#define     TMOD_T0_SEL     0x30        /*!< Mode selection [1:0] (decided by M1 and M0) */
#define     TMOD_T0_M1      0x02        /*!< BIT [1] */
#define     TMOD_T0_M0      0x01        /*!< BIT [0] */

#define     TMOD_T0_SEL_16B_AUTO_RELOAD             0x00     /*!< 16 bits auto reload mode. When T0 overflowing, T0 reload [TH0, TL0] */
#define     TMOD_T0_SEL_16B_REPEATED                0x10     /*!< 16 bits repeated mode. When T0 overflowing, T0 starts from 0. */
#define     TMOD_T0_SEL_8B_AUTO_RELOAD              0x20     /*!< 8 bits auto reload mode. When T0 overflowing, T0 reload [TL0] with [TH0]. */
#define     TMOD_T0_SEL_UNSHIELDED_16B_AUTO_RELOAD  0x30     /*!< unshielded 16 bits auto reload mode, which has the highest prioty */

