HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8hx.h
/* Bit definition for AUXR register */
#define     AUXR_T0x12      0x80        /*!< timer T0 speed selection ([0], CPU clock divied by 12; [1], CPU clock no division)*/
#define     AUXR_T1x12      0x40        /*!< timer T1 speed selection ([0], CPU clock divied by 12; [1], CPU clock no division) */

#define     AUXR_T2x12      0x04        /*!< timer T2 speed selection ([0], CPU clock divied by 12; [1], CPU clock no division) */
#define     AUXR_T2R        0x10        /*!< timer T2 running control bit */
#define     AUXR_T2CT       0x08        /*!< Timer/Counter T2 function selection: [0] timer-internal SYSCLK input; [1] counter-P1.2 input */

/* Bit definition for INTCLKO register  */
#define     INTCLKO_T0CLKO  0x01        /*!< timer T0 output control ([0], timer output disabled; [1], T0 overflow, P3.5 revert its level) */ 
#define     INTCLKO_T1CLKO  0x02        /*!< timer T1 output control ([0], timer output disabled; [1], T1 overflow, P3.4 revert its level) */ 

#define     INTCLKO_T2CLKO  0x04        /*!< timer T2 output control ([0], timer output disabled; [1], T2 overflow, P1.3 revert its level)*/ 

/* Bit definition for T4T3M register */
#define     T4T3M_T4R       0x80        /*!< timer T4 running control flag */ 
#define     T4T3M_T4_CT     0x40        /*!< Timer/Counter T4 function selection: [0] timer-internal SYSCLK input; [1] counter-P0.6 input */
#define     T4T3M_T4x12     0x20        /*!< timer T4 speed selection ([0], CPU clock divied by 12; [1], CPU clock no division) */
#define     T4T3M_T4CLKO    0x10        /*!< timer T4 output control ([0], timer output disabled; [1], T4 overflow, P0.7 revert its level)*/ 
#define     T4T3M_T3R       0x08        /*!< timer T3 running control flag */ 
#define     T4T3M_T3_CT     0x04        /*!< Timer/Counter T3 function selection: [0] timer-internal SYSCLK input; [1] counter-P0.6 input */
#define     T4T3M_T3x12     0x02        /*!< timer T3 speed selection ([0], CPU clock divied by 12; [1], CPU clock no division) */
#define     T4T3M_T3CLKO    0x01        /*!< timer T3 output control ([0], timer output disabled; [1], T3 overflow, P0.7 revert its level)*/ 

/* timer special function registers */
sfr TCON        =   TCON_ADDR;                      //!< Timer control regiseter
sfr TMOD        =   TMOD_ADDR;                      //!< Timer mode regiseter
sfr TL0         =   TL0_ADDR;                       //!< Timer T0 low 8 bytes regiseter
sfr TL1         =   TL1_ADDR;                       //!< Timer T1 low 8 bytes regiseter
sfr TH0         =   TH0_ADDR;                       //!< Timer T0 high 8 bytes regiseter
sfr TH1         =   TH1_ADDR;                       //!< Timer T1 high 8 bytes regiseter
sfr T4T3M       =   T4T3M_ADDR;                     //!< Timer T3/T4 control regiseter
sfr T4H         =   T4H_ADDR;                       //!< Timer T4 high 8 bytes regiseter
sfr T4L         =   T4L_ADDR;                       //!< Timer T4 low 8 bytes regiseter
sfr T3H         =   T3H_ADDR;                       //!< Timer T3 high 8 bytes regiseter
sfr T3L         =   T3L_ADDR;                       //!< Timer T3 low 8 bytes regiseter
sfr T2H         =   T2H_ADDR;                       //!< Timer T2 high 8 bytes regiseter
sfr T2L         =   T2L_ADDR;                       //!< Timer T2 low 8 bytes regiseter

#define     TM2PS      (*(__IO uint8_t xdata *) TM2PS_ADDR)
#define     TM3PS      (*(__IO uint8_t xdata *) TM3PS_ADDR)
#define     TM4PS      (*(__IO uint8_t xdata *) TM4PS_ADDR)


/* Bit definition for TCON register */
sbit TCON_TF1        =   TCON^7;                         /*!< timer T1 overflow interrupt flag */
sbit TCON_TR1        =   TCON^6;                         /*!< timer T1 running enabling control flag */
sbit TCON_TF0        =   TCON^5;                         /*!< timer T0 overflow interrupt flag */
sbit TCON_TR0        =   TCON^4;                         /*!< timer T0 running enabling control flag */
sbit TCON_IE1        =   TCON^3;                         /*!< external interrupt 1 request flag */
sbit TCON_IT1        =   TCON^2;                         /*!< external interrupt 1 trigger ways selection bit */
sbit TCON_IE0        =   TCON^1;                         /*!< external interrupt 0 request flag */
sbit TCON_IT0        =   TCON^0;                         /*!< external interrupt 0 trigger ways selection bit */

//! UART peripherals
/* UART basic address definition */
#define     S1CON_ADDR      0x98
#define     S1BUF_ADDR      0x99
#define     S2CON_ADDR      0x9A
#define     S2BUF_ADDR      0x9B
#define     S3CON_ADDR      0xAC
#define     S3BUF_ADDR      0xAD
#define     S4CON_ADDR      0x84
#define     S4BUF_ADDR      0x85
#define     SADDR_ADDR      0xA9
#define     SADEN_ADDR      0xB9

/* Bit definition for AUXR register */
#define     AUXR_UART_M0x6  0x20             /*!< serial port 1 mode 0 communication speed selection: [0], no change; [1], 6 times speed */
#define     AUXR_S1ST2      0x01             /*!< serial port 1 baud rate emitter selection: [0], T1; [1], T2 */

/* Bit definition for PCON register */
#define     PCON_SMOD       0x80             /*!< serial port 1 baud rate speed selection: [0], no change; [1], mode 1,2,3 baud rate double times */
#define     PCON_SMOD0      0x40             /*!< frame error detection control bit : [0], function not enabled; [1], SCON-SM0/FE works as FE */

/* Bit definition for S2CON register */
#define     S2SM0           0x80
#define     S2SM2           0x20
#define     S2REN           0x10
#define     S2TB8           0x08
#define     S2RB8           0x04
#define     S2TI            0x02
#define     S2RI            0x01

/* Bit definition for S3CON register */
#define     S3SM0           0x80
#define     S3ST3           0x40
#define     S3SM2           0x20
#define     S3REN           0x10
#define     S3TB8           0x08
#define     S3RB8           0x04
#define     S3TI            0x02
#define     S3RI            0x01

/* Bit definition for S4CON register */
#define     S4SM0           0x80
#define     S4ST4           0x40
#define     S4SM2           0x20
#define     S4REN           0x10
#define     S4TB8           0x08
#define     S4RB8           0x04
#define     S4TI            0x02
#define     S4RI            0x01

/* UART special function registers */
sfr S1CON       =   S1CON_ADDR;         //!< serial 1 control register
sfr S1BUF       =   S1BUF_ADDR;         //!< serial 1 data register
sfr S2CON       =   S2CON_ADDR;         //!< serial 2 control register
sfr S2BUF       =   S2BUF_ADDR;         //!< serial 2 data register
sfr S3CON       =   S3CON_ADDR;         //!< serial 3 control register
sfr S3BUF       =   S3BUF_ADDR;         //!< serial 3 data register
sfr S4CON       =   S4CON_ADDR;         //!< serial 4 control register
sfr S4BUF       =   S4BUF_ADDR;         //!< serial 4 data register
sfr SADDR       =   SADDR_ADDR;         //!< serial 1 slave address register
sfr SADEN       =   SADEN_ADDR;         //!< serial 1 slave shielded address register

/* Bit definition for SCON register */
sbit S1SM0        =   S1CON^7;
sbit S1SM1        =   S1CON^6;
sbit S1SM2        =   S1CON^5;
sbit S1REN        =   S1CON^4;
sbit S1TB8        =   S1CON^3;
sbit S1RB8        =   S1CON^2;
sbit S1TI         =   S1CON^1;
sbit S1RI         =   S1CON^0;

#define     SxCON(x)                (S##x##CON)

//! COMP peripherals
/* COMP basic address definition */
#define     CMPCR1_ADDR             0xE6
#define     CMPCR2_ADDR             0xE7

/* Bit definition for CMPCR1 register */
#define     CMPCR1_CMPEN            0x80      /*!< Comparator module enabling bit */
#define     CMPCR1_CMPIF            0x40      /*!< Comparator interrupt flag bit <*/
#define     CMPCR1_PIE              0x20      /*!< Comparator rising edge interrupt enabling bit */
#define     CMPCR1_NIE              0x10      /*!< Comparator falling edge interrupt enabling bit */
#define     CMPCR1_PIS              0x08      /*!< Comparator positive selection bit: [0], select P3.7 as the positive source; [1], select by ADC_CONTR-ADC_CHS */
#define     CMPCR1_NIS              0x04      /*!< Comparator negtive selection bit: [0], select REFV; select P3.6 as the negtive source*/
#define     CMPCR1_CMPOE            0x02      /*!< Comparator output control bit: [0], disable output; [1], P3.4 or P4.1 ouput pin, decided by P_SW2-CMPO_S */
#define     CMPCR1_CMPRES           0x01      /*!< The result of a comparator comparison: [0], CMP+ lower than CMP-; [1], CMP+ higher than CMP-; */

/* Bit definition for CMPCR2 register */
#define     CMPAR2_INVCMPO          0x80       /*!< Comparator output control: [0], positive output, 0 eq low level, 1 eq high level; [1], negtive output, 0 eq high level, 1 eq low level */
#define     CMPAR2_DISFLT           0x40      /*!< Analog filter function control: [0], enable; [1], disable */

#define     CMPAR2_LCDTY            0x3F      /*!< LCDTY[5:0] Digital filter function control. filtering time = LCDTY+2 */
#define     CMPAR2_LCDTY_0          0x01      /*!< Bit 0 */
#define     CMPAR2_LCDTY_1          0x02      /*!< Bit 1 */
#define     CMPAR2_LCDTY_2          0x04      /*!< Bit 2 */
#define     CMPAR2_LCDTY_3          0x08      /*!< Bit 3 */
#define     CMPAR2_LCDTY_4          0x10      /*!< Bit 4 */
#define     CMPAR2_LCDTY_5          0x20      /*!< Bit 5 */

#define     CMPAR2_LCDTY_VAL0       0x00      /*!< n=0, no filtering */
#define     CMPAR2_LCDTY_VAL1       0x01      /*!< n=1 */
#define     CMPAR2_LCDTY_VAL2       0x02      /*!< n=2 */
#define     CMPAR2_LCDTY_VAL3       0x03      /*!< n=3 */
#define     CMPAR2_LCDTY_VAL4       0x04      /*!< n=4 */
#define     CMPAR2_LCDTY_VAL5       0x05      /*!< n=5 */
#define     CMPAR2_LCDTY_VAL6       0x06      /*!< n=6 */
#define     CMPAR2_LCDTY_VAL7       0x07      /*!< n=7 */
#define     CMPAR2_LCDTY_VAL8       0x08      /*!< n=8 */
#define     CMPAR2_LCDTY_VAL9       0x09      /*!< n=9 */
#define     CMPAR2_LCDTY_VAL10      0x0A      /*!< n=10 */
#define     CMPAR2_LCDTY_VAL11      0x0B      /*!< n=11 */
#define     CMPAR2_LCDTY_VAL12      0x0C      /*!< n=12 */
#define     CMPAR2_LCDTY_VAL13      0x0D      /*!< n=13 */
#define     CMPAR2_LCDTY_VAL14      0x0E      /*!< n=14 */
#define     CMPAR2_LCDTY_VAL15      0x0F      /*!< n=15 */
#define     CMPAR2_LCDTY_VAL16      0x10      /*!< n=16 */
#define     CMPAR2_LCDTY_VAL17      0x11      /*!< n=17 */
#define     CMPAR2_LCDTY_VAL18      0x12      /*!< n=18 */
#define     CMPAR2_LCDTY_VAL19      0x13      /*!< n=19 */
#define     CMPAR2_LCDTY_VAL20      0x14      /*!< n=20 */
#define     CMPAR2_LCDTY_VAL21      0x15      /*!< n=21 */
#define     CMPAR2_LCDTY_VAL22      0x16      /*!< n=22 */
#define     CMPAR2_LCDTY_VAL23      0x17      /*!< n=23 */
#define     CMPAR2_LCDTY_VAL24      0x18      /*!< n=24 */
#define     CMPAR2_LCDTY_VAL25      0x19      /*!< n=25 */
#define     CMPAR2_LCDTY_VAL26      0x1A      /*!< n=26 */
#define     CMPAR2_LCDTY_VAL27      0x1B      /*!< n=27 */
#define     CMPAR2_LCDTY_VAL28      0x1C      /*!< n=28 */
#define     CMPAR2_LCDTY_VAL29      0x1D      /*!< n=29 */
#define     CMPAR2_LCDTY_VAL30      0x1E      /*!< n=30 */
#define     CMPAR2_LCDTY_VAL31      0x1F      /*!< n=31 */
#define     CMPAR2_LCDTY_VAL32      0x20      /*!< n=32 */
#define     CMPAR2_LCDTY_VAL33      0x21      /*!< n=33 */
#define     CMPAR2_LCDTY_VAL34      0x22      /*!< n=34 */
#define     CMPAR2_LCDTY_VAL35      0x23      /*!< n=35 */
#define     CMPAR2_LCDTY_VAL36      0x24      /*!< n=36 */
#define     CMPAR2_LCDTY_VAL37      0x25      /*!< n=37 */
#define     CMPAR2_LCDTY_VAL38      0x26      /*!< n=38 */
#define     CMPAR2_LCDTY_VAL39      0x27      /*!< n=39 */
#define     CMPAR2_LCDTY_VAL40      0x28      /*!< n=40 */
#define     CMPAR2_LCDTY_VAL41      0x29      /*!< n=41 */
#define     CMPAR2_LCDTY_VAL42      0x2A      /*!< n=42 */
#define     CMPAR2_LCDTY_VAL43      0x2B      /*!< n=43 */
#define     CMPAR2_LCDTY_VAL44      0x2C      /*!< n=44 */
#define     CMPAR2_LCDTY_VAL45      0x2D      /*!< n=45 */
#define     CMPAR2_LCDTY_VAL46      0x2E      /*!< n=46 */
#define     CMPAR2_LCDTY_VAL47      0x2F      /*!< n=47 */
#define     CMPAR2_LCDTY_VAL48      0x30      /*!< n=48 */
#define     CMPAR2_LCDTY_VAL49      0x31      /*!< n=49 */
#define     CMPAR2_LCDTY_VAL50      0x32      /*!< n=50 */
#define     CMPAR2_LCDTY_VAL51      0x33      /*!< n=51 */
#define     CMPAR2_LCDTY_VAL52      0x34      /*!< n=52 */
#define     CMPAR2_LCDTY_VAL53      0x35      /*!< n=53 */
#define     CMPAR2_LCDTY_VAL54      0x36      /*!< n=54 */
#define     CMPAR2_LCDTY_VAL55      0x37      /*!< n=55 */
#define     CMPAR2_LCDTY_VAL56      0x38      /*!< n=56 */
#define     CMPAR2_LCDTY_VAL57      0x39      /*!< n=57 */
#define     CMPAR2_LCDTY_VAL58      0x3A      /*!< n=58 */
#define     CMPAR2_LCDTY_VAL59      0x3B      /*!< n=59 */
#define     CMPAR2_LCDTY_VAL60      0x3C      /*!< n=60 */
#define     CMPAR2_LCDTY_VAL61      0x3D      /*!< n=61 */
#define     CMPAR2_LCDTY_VAL62      0x3E      /*!< n=62 */
#define     CMPAR2_LCDTY_VAL63      0x3F      /*!< n=63 */

sfr CMPCR1      =   CMPCR1_ADDR;    //!< comparator control register 1
sfr CMPCR2      =   CMPCR2_ADDR;    //!< comparator control register 2

//! EEPROM peripherals
/**
 * @brief EEPROM generic I/O definition
 */
struct IAP_EEPROM_struct{
    __IO uint8_t IAP_DATA;
    __IO uint8_t IAP_ADDRH;
    __IO uint8_t IAP_ADDRL;
    __IO uint8_t IAP_CMD;
    __IO uint8_t IAP_TRIG;
    __IO uint8_t IAP_CONTR;
};
#define IAP_EEPROM_TypeDef struct IAP_EEPROM_struct

/* EEPROM basic address definition */
#define     IAP_EEPROM_BASE         0xC2
#define     IAP_DATA_ADDR           0xC2
#define     IAP_ADDRH_ADDR          0xC3
#define     IAP_ADDRL_ADDR          0xC4
#define     IAP_CMD_ADDR            0xC5
#define     IAP_TRIG_ADDR           0xC6
#define     IAP_CONTR_ADDR          0xC7
#define     IAP_TPS_ADDR            0xF5


/* Bit definition for IAP_CONTR register */
#define     IAP_CONTR_IAPEN         0x80     /*!< EEPROM operation enable control bit: [0], disable; [1], enable */
#define     IAP_CONTR_SWBS          0x40     /*!< software reset select control bit, (need to be used with SWRST): [0], user code start; [1] ISP monitor space start */
#define     IAP_CONTR_SWRST         0x20     /*!< software reset control bit: [0], no action; [1], enable software reset */
#define     IAP_CONTR_CMD_FAIL      0x10     /*!< EEPROM operation failure status bit, requires software reset: [0], right; [1], false */

