HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8hx.h
/* Bit definition for IAP_CMD register */
#define     IAP_CMD_CMD             0x03     /*!< CMD[1:0], Send EEPROM Operation Command */
#define     IAP_CMD_CMD_0           0x01     /*!< Bit 0 */
#define     IAP_CMD_CMD_1           0x02     /*!< Bit 1 */

#define     IAP_CMD_CMD_NOP         0x00     /*!< nop */
#define     IAP_CMD_CMD_READ        0x01     /*!< read 1 byte at target address */
#define     IAP_CMD_CMD_WRITE       0x02     /*!< write 1 byte to target address, converting 1 to 0 */
#define     IAP_CMD_CMD_ERASE       0x03     /*!< Erase EEPROM. Erase the 1 page (1 sector/512 bytes) to FFH where the destination address is located.  */

#define     IAP_EEPROM              (*((IAP_EEPROM_TypeDef idata* xdata*) IAP_EEPROM_BASE))

/* IAP special function registers */
sfr IAP_DATA    =   IAP_DATA_ADDR;                      //!< IAP data regiseter
sfr IAP_ADDRH   =   IAP_ADDRH_ADDR;                     //!< IAP high address regiseter
sfr IAP_ADDRL   =   IAP_ADDRL_ADDR;                     //!< IAP low address regiseter
sfr IAP_CMD     =   IAP_CMD_ADDR;                       //!< IAP command regiseter
sfr IAP_TRIG    =   IAP_TRIG_ADDR;                      //!< IAP trigger regiseter
sfr IAP_CONTR   =   IAP_CONTR_ADDR;                     //!< IAP control regiseter
sfr IAP_TPS     =   IAP_TPS_ADDR;                       //!< EEPROM wait time control register. Set this register value the same as the working frequency.

//! ADC peripherals
/**
 * @brief ADC generic I/O definition
 */
struct ADC_struct{
    __IO uint8_t ADC_CONTR;
    __IO uint8_t ADC_RESH;
    __IO uint8_t ADC_RESL;
    __IO uint8_t ADCCFG;
};
#define ADC_TypeDef struct ADC_struct

/* ADC basic address definition */
#define     ADC_BASE        0xBC

#define     ADC_CONTR_ADDR  0xBC
#define     ADC_RESH_ADDR   0xBD
#define     ADC_RESL_ADDR   0xBE
#define     ADCCFG_ADDR     0xDE

#define     ADCTIM_ADDR     0xFEA8
#define     ADCEXCFG_ADDR   0xFEAD


/* Bit definition for ADC_CONTR register */
#define     ADC_CONTR_ADC_POWER       0x80           /*!< ADC power control: [0], closed; [1], open */
#define     ADC_CONTR_ADC_START       0x40           /*!< ADC conversion start control: [0], no action; [1], start ADC, auto firmware clearance for this bit */
#define     ADC_CONTR_ADC_FLAG        0x20           /*!< ADC conversion over flag: firmware set 1 when conversion finished. interrupt request sent to CPU. Software reset to 0 needed. */
#define     ADC_CONTR_ADC_EPWMT       0x10           /*!< ADC realtime trigger function enabling */

#define     ADC_CONTR_ADC_CHS         0x0F           /*!< ADC_CHS[3:0], ADC analog channel selection bits */
#define     ADC_CONTR_ADC_CHS_0       0x01           /*!< Bit 0 */
#define     ADC_CONTR_ADC_CHS_1       0x02           /*!< Bit 1 */
#define     ADC_CONTR_ADC_CHS_2       0x04           /*!< Bit 2 */
#define     ADC_CONTR_ADC_CHS_3       0x08           /*!< Bit 3 */

#define     ADC_CONTR_ADC_CHS_VAL0    0x00           /*!< P1.0/ADC0 */
#define     ADC_CONTR_ADC_CHS_VAL1    0x01           /*!< P1.1/ADC1 */
#define     ADC_CONTR_ADC_CHS_VAL2    0x02           /*!< P1.2/ADC2 */
#define     ADC_CONTR_ADC_CHS_VAL3    0x03           /*!< P1.3/ADC3 */
#define     ADC_CONTR_ADC_CHS_VAL4    0x04           /*!< P1.4/ADC4 */
#define     ADC_CONTR_ADC_CHS_VAL5    0x05           /*!< P1.5/ADC5 */
#define     ADC_CONTR_ADC_CHS_VAL6    0x06           /*!< P1.6/ADC6 */
#define     ADC_CONTR_ADC_CHS_VAL7    0x07           /*!< P1.7/ADC7 */
#define     ADC_CONTR_ADC_CHS_VAL8    0x08           /*!< P0.0/ADC8 */
#define     ADC_CONTR_ADC_CHS_VAL9    0x09           /*!< P0.1/ADC9 */
#define     ADC_CONTR_ADC_CHS_VAL10   0x0A           /*!< P0.2/ADC10 */
#define     ADC_CONTR_ADC_CHS_VAL11   0x0B           /*!< P0.3/ADC11 */
#define     ADC_CONTR_ADC_CHS_VAL12   0x0C           /*!< P0.4/ADC12 */
#define     ADC_CONTR_ADC_CHS_VAL13   0x0D           /*!< P0.5/ADC13 */
#define     ADC_CONTR_ADC_CHS_VAL14   0x0E           /*!< P0.6/ADC14 */
#define     ADC_CONTR_ADC_CHS_VAL15   0x0F           /*!< REFV */

/* Bit definition for ADCCFG register */
#define     ADCCFG_ADC_RESFMT         0x20           /*!< ADC conversion result format control bit: [0], align Left; [1], align right */

#define     ADCCFG_SPEED              0x0F           /*!< SPEED[3:0], ADC clock control */
#define     ADCCFG_SPEED_0            0x01          /*!< Bit 0 */
#define     ADCCFG_SPEED_1            0x02          /*!< Bit 1 */
#define     ADCCFG_SPEED_2            0x04          /*!< Bit 2 */
#define     ADCCFG_SPEED_3            0x08          /*!< Bit 3 */

// F_ADC SYSclk/2/16/SPEED[3:0]+1
#define     ADCCFG_SPEED_32tk         0x00          /*!< SYSCLK tick number: 32 ticks*/
#define     ADCCFG_SPEED_64tk         0x01          /*!< SYSCLK tick number: 64 ticks*/
#define     ADCCFG_SPEED_96tk         0x02          /*!< SYSCLK tick number: 96 ticks*/
#define     ADCCFG_SPEED_128tk        0x03          /*!< SYSCLK tick number: 128 ticks*/
#define     ADCCFG_SPEED_160tk        0x04          /*!< SYSCLK tick number: 160 ticks*/
#define     ADCCFG_SPEED_192tk        0x05          /*!< SYSCLK tick number: 192 ticks*/
#define     ADCCFG_SPEED_224tk        0x06          /*!< SYSCLK tick number: 224 ticks*/
#define     ADCCFG_SPEED_256tk        0x07          /*!< SYSCLK tick number: 256 ticks*/
#define     ADCCFG_SPEED_288tk        0x08          /*!< SYSCLK tick number: 288 ticks*/
#define     ADCCFG_SPEED_320tk        0x09          /*!< SYSCLK tick number: 320 ticks*/
#define     ADCCFG_SPEED_352tk        0x0A          /*!< SYSCLK tick number: 352 ticks*/
#define     ADCCFG_SPEED_384tk        0x0B          /*!< SYSCLK tick number: 384 ticks*/
#define     ADCCFG_SPEED_416tk        0x0C          /*!< SYSCLK tick number: 416 ticks*/
#define     ADCCFG_SPEED_448tk        0x0D          /*!< SYSCLK tick number: 448 ticks*/
#define     ADCCFG_SPEED_480tk        0x0E          /*!< SYSCLK tick number: 480 ticks*/
#define     ADCCFG_SPEED_512tk        0x0F          /*!< SYSCLK tick number: 512 ticks*/

/* Bit definition for ADCTIM register */
#define     ADCTIM_CSSETUP              0x80          /*!< ADC channel selection time control(Number of ADC system clock ticks consumed): [0], 1 tick; [1], 2 ticks */

#define     ADCTIM_CSHOLD               0x60          /*!< CSHOLD[1:0], ADC channel selection hold time control */
#define     ADCTIM_CSHOLD_0             0x20          /*!< Bit 0 */
#define     ADCTIM_CSHOLD_1             0x40          /*!< Bit 1 */

