HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8hx.h
// Number of ADC system clock ticks consumed
#define     ADCTIM_CSHOLD_1tk           0x00
#define     ADCTIM_CSHOLD_2tk           0x20
#define     ADCTIM_CSHOLD_3tk           0x40
#define     ADCTIM_CSHOLD_4tk           0x60

#define     ADCTIM_SMPDUTY              0x1F          /*!< CSHOLD[4:0], Sampling time control of ADC analog signal */
#define     ADCTIM_SMPDUTY_0            0x01          /*!< Bit 0 */
#define     ADCTIM_SMPDUTY_1            0x02          /*!< Bit 1 */
#define     ADCTIM_SMPDUTY_2            0x04          /*!< Bit 2 */
#define     ADCTIM_SMPDUTY_3            0x08          /*!< Bit 3 */
#define     ADCTIM_SMPDUTY_4            0x10          /*!< Bit 4 */

// Number of ADC system clock ticks consumed
#define     ADCTIM_SMPDUT_1tk           0x00
#define     ADCTIM_SMPDUT_2tk           0x01
#define     ADCTIM_SMPDUT_3tk           0x02
#define     ADCTIM_SMPDUT_4tk           0x03
#define     ADCTIM_SMPDUT_5tk           0x04
#define     ADCTIM_SMPDUT_6tk           0x05
#define     ADCTIM_SMPDUT_7tk           0x06
#define     ADCTIM_SMPDUT_8tk           0x07
#define     ADCTIM_SMPDUT_9tk           0x08
#define     ADCTIM_SMPDUT_10tk          0x09
#define     ADCTIM_SMPDUT_11tk          0x0A
#define     ADCTIM_SMPDUT_12tk          0x0B
#define     ADCTIM_SMPDUT_13tk          0x0C
#define     ADCTIM_SMPDUT_14tk          0x0D
#define     ADCTIM_SMPDUT_15tk          0x0E
#define     ADCTIM_SMPDUT_16tk          0x0F
#define     ADCTIM_SMPDUT_17tk          0x10
#define     ADCTIM_SMPDUT_18tk          0x11
#define     ADCTIM_SMPDUT_19tk          0x12
#define     ADCTIM_SMPDUT_20tk          0x13
#define     ADCTIM_SMPDUT_21tk          0x14
#define     ADCTIM_SMPDUT_22tk          0x15
#define     ADCTIM_SMPDUT_23tk          0x16
#define     ADCTIM_SMPDUT_24tk          0x17
#define     ADCTIM_SMPDUT_25tk          0x18
#define     ADCTIM_SMPDUT_26tk          0x19
#define     ADCTIM_SMPDUT_27tk          0x1A
#define     ADCTIM_SMPDUT_28tk          0x1B
#define     ADCTIM_SMPDUT_29tk          0x1C
#define     ADCTIM_SMPDUT_30tk          0x1D
#define     ADCTIM_SMPDUT_31tk          0x1E
#define     ADCTIM_SMPDUT_32tk          0x1F

/* Bit definition for ADCEXCFG register */
#define     ADCEXCFG_ADCETRS                        0x30         /*!< ADCETRS[1:0], ADC external trigger pin ADC_ETR control bit */
#define     ADCEXCFG_ADCETRS_0                      0x10         /*!< Bit 0 */
#define     ADCEXCFG_ADCETRS_1                      0x20         /*!< Bit 1 */

#define     ADCEXCFG_ADCETRS_DISABLE                0x10         /*!< disable ETR function */
#define     ADCEXCFG_ADCETRS_ENABLE_RISING_TRIGGER  0x20         /*!< enable ADC_ETR rising trigger mode */
#define     ADCEXCFG_ADCETRS_ENABLE_FALLING_TRIGGER 0x30         /*!< enable ADC_ETR falling trigger mode */

#define     ADCEXCFG_CVTIMESEL                      0x07         /*!< CVTIMESEL[2:0], ADC auto conversion times selection */
#define     ADCEXCFG_CVTIMESEL_0                    0x01         /*!< Bit 0 */
#define     ADCEXCFG_CVTIMESEL_1                    0x02         /*!< Bit 1 */
#define     ADCEXCFG_CVTIMESEL_2                    0x04         /*!< Bit 2 */

#define     ADCEXCFG_CVTIMESEL_1_CONVERSION         0x03
#define     ADCEXCFG_CVTIMESEL_2_CONVERSION_AVG     0x04
#define     ADCEXCFG_CVTIMESEL_4_CONVERSION_AVG     0x05
#define     ADCEXCFG_CVTIMESEL_8_CONVERSION_AVG     0x06
#define     ADCEXCFG_CVTIMESEL_16_CONVERSION_AVG    0x07

#define     ADCTIM                      (*(__IO uint8_t xdata *) ADCTIM_ADDR)
#define     ADCEXCFG                    (*(__IO uint8_t xdata *) ADCEXCFG_ADDR)
#define     ADC                         (*((ADC_TypeDef idata* xdata*) ADC_BASE))

/* ADC special function registers */
sfr ADC_CONTR   =   ADC_CONTR_ADDR;                 //!< ADC control register
sfr ADC_RESH    =   ADC_RESH_ADDR;                  //!< ADC conversion result high bytes register
sfr ADC_RESL    =   ADC_RESL_ADDR;                  //!< ADC conversion result low bytes register
sfr ADCCFG      =   ADCCFG_ADDR;                    //!< ADC configuration register

//! PCA peripherals
/**
 * @brief PCA generic I/O definition
 */
struct PCAx_struct{
    __IO uint8_t CCAPMx;
    uint8_t RESERVED0[4];
    __IO uint8_t CCAPxL;
    uint8_t RESERVED1[3];
    __IO uint8_t PCA_PWMx;
    uint8_t RESERVED2[4];
    __IO uint8_t CCAPxH;
};
#define PCAx_TypeDef struct PCAx_struct

/* PCA basic address definition */
#define     PCAx_BASE       0xDA
#define     PCA0_BASE       (PCAx_BASE + 0x00)
#define     PCA1_BASE       (PCAx_BASE + 0x01)
#define     PCA2_BASE       (PCAx_BASE + 0x02)
#define     PCA3_BASE       (PCAx_BASE + 0x03)

#define     CCON_ADDR       0xD8
#define     CMOD_ADDR       0xD9
#define     CL_ADDR         0xE9
#define     CH_ADDR         0xF9
#define     CCAPM0_ADDR     0xDA
#define     CCAPM1_ADDR     0xDB
#define     CCAPM2_ADDR     0xDC
#define     CCAPM3_ADDR     0xDD
#define     CCAP0L_ADDR     0xEA
#define     CCAP1L_ADDR     0xEB
#define     CCAP2L_ADDR     0xEC
#define     CCAP3L_ADDR     0xED
#define     CCAP0H_ADDR     0xFA
#define     CCAP1H_ADDR     0xFB
#define     CCAP2H_ADDR     0xFC
#define     CCAP3H_ADDR     0xFD
#define     PCA_PWM0_ADDR   0xF2
#define     PCA_PWM1_ADDR   0xF3
#define     PCA_PWM2_ADDR   0xF4
#define     PCA_PWM3_ADDR   0xF5

/* Bit definition for CMOD register */
#define     CMOD_CIDL       0x80             /*!< Whether to stop PCA counting in idle mode: [0], continue; [1], stop */

#define     CMOD_CPS        0x0E             /*!< CPS[2:0], PCA counting pulse source selection bit */
#define     CMOD_CPS_0      0x02             /*!< Bit 0 */
#define     CMOD_CPS_1      0x04             /*!< Bit 1 */
#define     CMOD_CPS_2      0x08             /*!< Bit 2 */

#define     CMOD_CPS_SC1    0x00             /*!< SYSCLK/12 */
#define     CMOD_CPS_SC2    0x02             /*!< SYSCLK/2 */
#define     CMOD_CPS_SC3    0x04             /*!< Overshoot pulse of Timer T0  */
#define     CMOD_CPS_SC4    0x06             /*!< ECI pin's external input clock */
#define     CMOD_CPS_SC5    0x08             /*!< SYSCLK/1 */
#define     CMOD_CPS_SC6    0x0A             /*!< SYSCLK/4 */
#define     CMOD_CPS_SC7    0x0C             /*!< SYSCLK/6 */
#define     CMOD_CPS_SC8    0x0E             /*!< SYSCLK/8 */

#define     CMOD_ECF        0x01             /*!< PCA counter overflow interrupt: [0], disable; [1], enable */

