HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8hx.h
/*
    CCAPPN: allow PCA module N to compare function 
    CCAPPn: allow PCA module N to do up-edge capture 
    CCAPNn: allow PCA module N to do down-edge capture 
    Matn:   allow PCA module N to do matching function 
    TOGn:   allow PCA module N to do high-speed pulse output function 
    pwnn:   allow PCA module N to do pulse width modulation output function 
    ECCFn:  allow PCA module N to do matching/capture interrupt
 */


/* Bit definition for CCAPM0 register */
#define     CCAPM0_ECOM0           0x40
#define     CCAPM0_CCAPP0          0x20
#define     CCAPM0_CCAPN0          0x10
#define     CCAPM0_MAT0            0x08
#define     CCAPM0_TOG0            0x04
#define     CCAPM0_PWM0            0x02
#define     CCAPM0_ECCF0           0x01

/* Bit definition for CCAPM1 register */
#define     CCAPM1_ECOM1           0x40
#define     CCAPM1_CCAPP1          0x20
#define     CCAPM1_CCAPN1          0x10
#define     CCAPM1_MAT1            0x08
#define     CCAPM1_TOG1            0x04
#define     CCAPM1_PWM1            0x02
#define     CCAPM1_ECCF1           0x01

/* Bit definition for CCAPM2 register */
#define     CCAPM2_ECOM2           0x40
#define     CCAPM2_CCAPP2          0x20
#define     CCAPM2_CCAPN2          0x10
#define     CCAPM2_MAT2            0x08
#define     CCAPM2_TOG2            0x04
#define     CCAPM2_PWM2            0x02
#define     CCAPM2_ECCF2           0x01

/* Bit definition for CCAPM3 register */
#define     CCAPM3_ECOM3           0x40
#define     CCAPM3_CCAPP3          0x20
#define     CCAPM3_CCAPN3          0x10
#define     CCAPM3_MAT3            0x08
#define     CCAPM3_TOG3            0x04
#define     CCAPM3_PWM3            0x02
#define     CCAPM3_ECCF3           0x01

/* PCA special function registers */
sfr CCON        =   CCON_ADDR;                  //!< PCA control register
sfr CMOD        =   CMOD_ADDR;                  //!< PCA mode register
sfr CL          =   CL_ADDR;                    //!< PCA counter low bytes
sfr CH          =   CH_ADDR;                    //!< PCA counter high bytes
sfr CCAPM0      =   CCAPM0_ADDR;                //!< PCA module 0 mode control register
sfr CCAPM1      =   CCAPM1_ADDR;                //!< PCA module 1 mode control register
sfr CCAPM2      =   CCAPM2_ADDR;                //!< PCA module 2 mode control register
sfr CCAPM3      =   CCAPM3_ADDR;                //!< PCA module 3 mode control register
sfr CCAP0L      =   CCAP0L_ADDR;                //!< PCA module 0 low bytes
sfr CCAP1L      =   CCAP1L_ADDR;                //!< PCA module 1 low bytes
sfr CCAP2L      =   CCAP2L_ADDR;                //!< PCA module 2 low bytes
sfr CCAP3L      =   CCAP3L_ADDR;                //!< PCA module 3 low bytes
sfr CCAP0H      =   CCAP0H_ADDR;                //!< PCA module 0 high bytes
sfr CCAP1H      =   CCAP1H_ADDR;                //!< PCA module 1 high bytes
sfr CCAP2H      =   CCAP2H_ADDR;                //!< PCA module 2 high bytes
sfr CCAP3H      =   CCAP3H_ADDR;                //!< PCA module 3 high bytes
sfr PCA_PWM0    =   PCA_PWM0_ADDR;              //!< PCA0 PWM mode register
sfr PCA_PWM1    =   PCA_PWM1_ADDR;              //!< PCA1 PWM mode register
sfr PCA_PWM2    =   PCA_PWM2_ADDR;              //!< PCA2 PWM mode register
sfr PCA_PWM3    =   PCA_PWM3_ADDR;              //!< PCA3 PWM mode register

// PCA generic struct type definitions
#define     PCA0                    (*((PCAx_TypeDef idata* xdata *) PCA0_BASE))
#define     PCA1                    (*((PCAx_TypeDef idata* xdata *) PCA1_BASE))
#define     PCA2                    (*((PCAx_TypeDef idata* xdata *) PCA2_BASE))
#define     PCA3                    (*((PCAx_TypeDef idata* xdata *) PCA3_BASE))

/* Bit definition for CCON register */
sbit CCON_CF         =   CCON^7;                /*!< PCA counter overflow interrupt flag */
sbit CCON_CR         =   CCON^6;                /*!< PCA counter enabling control bit */
sbit CCON_CCF3       =   CCON^3;                /*!< CCF3 PCA module interrupt flag */
sbit CCON_CCF2       =   CCON^2;                /*!< CCF2 PCA module interrupt flag */
sbit CCON_CCF1       =   CCON^1;                /*!< CCF1 PCA module interrupt flag */
sbit CCON_CCF0       =   CCON^0;                /*!< CCF0 PCA module interrupt flag */

//! PWM peripherals
/**
 * @brief General PWM function I/O
 */
struct PWMx_struct{
    __IO uint8_t PWMxT1H;
    __IO uint8_t PWMxT1L;
    __IO uint8_t PWMxT2H;
    __IO uint8_t PWMxT2L;
    __IO uint8_t PWMxCR;
    __IO uint8_t PWMxHLD;
};
#define PWMx_TypeDef struct PWMx_struct

/* PWM basic address definition */
#define     PWMCFG_ADDR     0xF1
#define     PWMIF_ADDR      0xF6
#define     PWMFDCR_ADDR    0xF7
#define     PWMCR_ADDR      0xFE

#define     PWMC_BASE       0xFFF0
#define     PWMCH_ADDR      (PWMC_BASE + 0x0000)
#define     PWMCL_ADDR      (PWMC_BASE + 0x0001)
#define     PWMCKS_ADDR     (PWMC_BASE + 0x0002)

#define     PWM0_BASE       0xFF00
#define     PWM1_BASE       0xFF10
#define     PWM2_BASE       0xFF20
#define     PWM3_BASE       0xFF30
#define     PWM4_BASE       0xFF40
#define     PWM5_BASE       0xFF50
#define     PWM6_BASE       0xFF60
#define     PWM7_BASE       0xFF70

#define     TADCP_BASE      0xFFF3
#define     TADCPH_ADDR     (TADCP_BASE + 0x0000)
#define     TADCPL_ADDR     (TADCP_BASE + 0x0001)

#define     PWM0T1_ADDR     (PWM0_BASE + 0x00)
#define     PWM0T1H_ADDR    (PWM0T1_ADDR +  0x00)
#define     PWM0T1L_ADDR    (PWM0T1H_ADDR + 0x01)
#define     PWM0T2_ADDR     (PWM0T1L_ADDR + 0x01)
#define     PWM0T2H_ADDR    (PWM0T2_ADDR +  0x00)
#define     PWM0T2L_ADDR    (PWM0T2H_ADDR + 0x01)
#define     PWM0CR_ADDR     (PWM0T2L_ADDR + 0x01)
#define     PWM0HLD_ADDR    (PWM0CR_ADDR +  0x01)

#define     PWM1T1_ADDR     (PWM1_BASE + 0x00)
#define     PWM1T1H_ADDR    (PWM1T1_ADDR +  0x00)
#define     PWM1T1L_ADDR    (PWM1T1H_ADDR + 0x01)
#define     PWM1T2_ADDR     (PWM1T1L_ADDR + 0x01)
#define     PWM1T2H_ADDR    (PWM1T2_ADDR +  0x00)
#define     PWM1T2L_ADDR    (PWM1T2H_ADDR + 0x01)
#define     PWM1CR_ADDR     (PWM1T2L_ADDR + 0x01)
#define     PWM1HLD_ADDR    (PWM1CR_ADDR +  0x01)

#define     PWM2T1_ADDR     (PWM2_BASE + 0x00)
#define     PWM2T1H_ADDR    (PWM2T1_ADDR +  0x00)
#define     PWM2T1L_ADDR    (PWM2T1H_ADDR + 0x01)
#define     PWM2T2_ADDR     (PWM2T1L_ADDR + 0x01)
#define     PWM2T2H_ADDR    (PWM2T2_ADDR +  0x00)
#define     PWM2T2L_ADDR    (PWM2T2H_ADDR + 0x01)
#define     PWM2CR_ADDR     (PWM2T2L_ADDR + 0x01)
#define     PWM2HLD_ADDR    (PWM2CR_ADDR +  0x01)

#define     PWM3T1_ADDR     (PWM3_BASE + 0x00)
#define     PWM3T1H_ADDR    (PWM3T1_ADDR +  0x00)
#define     PWM3T1L_ADDR    (PWM3T1H_ADDR + 0x01)
#define     PWM3T2_ADDR     (PWM3T1L_ADDR + 0x01)
#define     PWM3T2H_ADDR    (PWM3T2_ADDR +  0x00)
#define     PWM3T2L_ADDR    (PWM3T2H_ADDR + 0x01)
#define     PWM3CR_ADDR     (PWM3T2L_ADDR + 0x01)
#define     PWM3HLD_ADDR    (PWM3CR_ADDR +  0x01)

#define     PWM4T1_ADDR     (PWM4_BASE + 0x00)
#define     PWM4T1H_ADDR    (PWM4T1_ADDR +  0x00)
#define     PWM4T1L_ADDR    (PWM4T1H_ADDR + 0x01)
#define     PWM4T2_ADDR     (PWM4T1L_ADDR + 0x01)
#define     PWM4T2H_ADDR    (PWM4T2_ADDR +  0x00)
#define     PWM4T2L_ADDR    (PWM4T2H_ADDR + 0x01)
#define     PWM4CR_ADDR     (PWM4T2L_ADDR + 0x01)
#define     PWM4HLD_ADDR    (PWM4CR_ADDR +  0x01)

#define     PWM5T1_ADDR     (PWM5_BASE + 0x00)
#define     PWM5T1H_ADDR    (PWM5T1_ADDR +  0x00)
#define     PWM5T1L_ADDR    (PWM5T1H_ADDR + 0x01)
#define     PWM5T2_ADDR     (PWM5T1L_ADDR + 0x01)
#define     PWM5T2H_ADDR    (PWM5T2_ADDR +  0x00)
#define     PWM5T2L_ADDR    (PWM5T2H_ADDR + 0x01)
#define     PWM5CR_ADDR     (PWM5T2L_ADDR + 0x01)
#define     PWM5HLD_ADDR    (PWM5CR_ADDR +  0x01)

#define     PWM6T1_ADDR     (PWM6_BASE + 0x00)
#define     PWM6T1H_ADDR    (PWM6T1_ADDR +  0x00)
#define     PWM6T1L_ADDR    (PWM6T1H_ADDR + 0x01)
#define     PWM6T2_ADDR     (PWM6T1L_ADDR + 0x01)
#define     PWM6T2H_ADDR    (PWM6T2_ADDR +  0x00)
#define     PWM6T2L_ADDR    (PWM6T2H_ADDR + 0x01)
#define     PWM6CR_ADDR     (PWM6T2L_ADDR + 0x01)
#define     PWM6HLD_ADDR    (PWM6CR_ADDR +  0x01)

#define     PWM7T1_ADDR     (PWM7_BASE + 0x00)
#define     PWM7T1H_ADDR    (PWM7T1_ADDR +  0x00)
#define     PWM7T1L_ADDR    (PWM7T1H_ADDR + 0x01)
#define     PWM7T2_ADDR     (PWM7T1L_ADDR + 0x01)
#define     PWM7T2H_ADDR    (PWM7T2_ADDR +  0x00)
#define     PWM7T2L_ADDR    (PWM7T2H_ADDR + 0x01)
#define     PWM7CR_ADDR     (PWM7T2L_ADDR + 0x01)
#define     PWM7HLD_ADDR    (PWM7CR_ADDR +  0x01)

