HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8hx.h
/* Bit definition for PWMCFG register */
#define     PWMCFG_CBIF     0x80             /*!< Zero interrupt flag bit for PWM counter overflow happens */
#define     PWMCFG_ETADC    0x40             /*!< Whether PWM associates with ADC */

/* Bit definition for PWMIF register */
#define     PWMIF_C7IF      0x80             /*!< Interrupt flag bit for channel 7 PWM */
#define     PWMIF_C6IF      0x40             /*!< Interrupt flag bit for channel 6 PWM */
#define     PWMIF_C5IF      0x20             /*!< Interrupt flag bit for channel 5 PWM */
#define     PWMIF_C4IF      0x10             /*!< Interrupt flag bit for channel 4 PWM */
#define     PWMIF_C3IF      0x08             /*!< Interrupt flag bit for channel 3 PWM */
#define     PWMIF_C2IF      0x04             /*!< Interrupt flag bit for channel 2 PWM */
#define     PWMIF_C1IF      0x02             /*!< Interrupt flag bit for channel 1 PWM */
#define     PWMIF_C0IF      0x01             /*!< Interrupt flag bit for channel 0 PWM */

/* Bit definition for PWMFDCR register */
#define     PWMFDCR_INVCMP  0x80             /*!< Abnormal signal processing of comparator result: [0] low to high abnormal signal; [1], high to low abnormal signal */
#define     PWMFDCR_INVIO   0x40             /*!< external port P3.5 abnormal signal processing: [0] low to high abnormal signal; [1], high to low abnormal signal*/
#define     PWMFDCR_ENFD    0x20             /*!< PWM external abnormal detection control bit: [0], disable; [1], enable */
#define     PWMFDCR_FLTFLIO 0x10             /*!< Control bit of PWM output port when external PWM abnormity occurs: [0], no action; [1], high impedance */
#define     PWMFDCR_EFDI    0x08             /*!< PWM abnormal detection interrupt enabling bit: [0], disable; [1], enable */
#define     PWMFDCR_FDCMP   0x04             /*!< Comparator output anomaly detection enable bit: [0], comparator is unrelative with PWM; [1], Set the PWM abnormal detection source as the comparator output */
#define     PWMFDCR_FDIO    0x02             /*!< P3.5 port level anomaly detection enable bit: [0], P3.5 port level is PWM Independent; [1], Set the abnormal detection source of PWM to P3.5 port */
#define     PWMFDCR_FDIF    0x01             /*!< Abnormal PWM detection interrupt flag bit */

/* Bit definition for PWMCR register */
#define     PWMCR_ENPWM     0x80             /*!< Enable enhanced PWM waveform generator: [0], disable; [1], enable */
#define     PWMCR_ECBI      0x40             /*!< PWM counter zeroing interrupt enable bit: [0], disable; [1], enable */

/* Bit definition for PWMCKS register */
#define     PWMCKS_SELT2    0x0F             /*!< PWM clock source selection: [0], PWM clock source is the system clock frequency divider after the clock; [1], The PWM clock source is the overflow pulse of Timer 2 */

// If SELT2=1, the following setting will be invalid.
#define     PWMCKS_PWM_PS    0x0F             /*!< PWM_PS[3:0], System clock pre-frequency parameter */
#define     PWMCKS_PWM_PS_0  0x01             /*!< Bit 0 */
#define     PWMCKS_PWM_PS_1  0x02             /*!< Bit 1 */
#define     PWMCKS_PWM_PS_2  0x04             /*!< Bit 2 */
#define     PWMCKS_PWM_PS_3  0x08             /*!< Bit 3 */

#define     PWMCKS_PWM_PS_SCLK_DIV1     0x00  /*!< pre-frequency = SCLK/1 */
#define     PWMCKS_PWM_PS_SCLK_DIV2     0x01  /*!< pre-frequency = SCLK/2 */
#define     PWMCKS_PWM_PS_SCLK_DIV3     0x02  /*!< pre-frequency = SCLK/3 */
#define     PWMCKS_PWM_PS_SCLK_DIV4     0x03  /*!< pre-frequency = SCLK/4 */
#define     PWMCKS_PWM_PS_SCLK_DIV5     0x04  /*!< pre-frequency = SCLK/5 */
#define     PWMCKS_PWM_PS_SCLK_DIV6     0x05  /*!< pre-frequency = SCLK/6 */
#define     PWMCKS_PWM_PS_SCLK_DIV7     0x06  /*!< pre-frequency = SCLK/7 */
#define     PWMCKS_PWM_PS_SCLK_DIV8     0x07  /*!< pre-frequency = SCLK/8 */
#define     PWMCKS_PWM_PS_SCLK_DIV9     0x08  /*!< pre-frequency = SCLK/9 */
#define     PWMCKS_PWM_PS_SCLK_DIV10    0x09  /*!< pre-frequency = SCLK/10 */
#define     PWMCKS_PWM_PS_SCLK_DIV11    0x0A  /*!< pre-frequency = SCLK/11 */
#define     PWMCKS_PWM_PS_SCLK_DIV12    0x0B  /*!< pre-frequency = SCLK/12 */
#define     PWMCKS_PWM_PS_SCLK_DIV13    0x0C  /*!< pre-frequency = SCLK/13 */
#define     PWMCKS_PWM_PS_SCLK_DIV14    0x0D  /*!< pre-frequency = SCLK/14 */
#define     PWMCKS_PWM_PS_SCLK_DIV15    0x0E  /*!< pre-frequency = SCLK/15 */
#define     PWMCKS_PWM_PS_SCLK_DIV16    0x0F  /*!< pre-frequency = SCLK/16 */


/* PWM special function registers */
sfr PWMCFG      =   PWMCFG_ADDR;        //!< Enhanced PWM configuration register
sfr PWMIF       =   PWMIF_ADDR;         //!< Enhanced PWM interrupt flag register
sfr PWMFDCR     =   PWMFDCR_ADDR;       //!< Enhanced PWM Anomaly Detection Control Decision Register
sfr PWMCR       =   PWMCR_ADDR;         //!< Enhanced PWM configuration register

#define     PWMC            (*(__IO uint16_t xdata *) PWMC_BASE)         //!< [PWMCH,PWMCL]
#define     PWMCH           (*(__IO uint8_t xdata *)  PWMCH_ADDR)        //!< High Byte PWM counter register
#define     PWMCL           (*(__IO uint8_t xdata *)  PWMCL_ADDR)        //!< Low Byte PWM counter register
#define     PWMCKS          (*(__IO uint8_t xdata *)  PWMCKS_ADDR)       //!< PWM clock selection register
#define     TADCP           (*(__IO uint16_t xdata *) TADCP_BASE)        //!< [TADCPH, TADCPL]
#define     TADCPH          (*(__IO uint8_t xdata *)  TADCPH_ADDR)       //!< The trigger ADC counts high bytes register
#define     TADCPL          (*(__IO uint8_t xdata *)  TADCPL_ADDR)       //!< The trigger ADC counts low bytes register

#define     PWMxT1(PWMxT1_ADDR)      (*(__IO uint16_t xdata *) PWMxT1_ADDR)  //!< PWMxT1 counter [PWMxT1H, PWMxT1L]
#define     PWMxT2(PWMxT2_ADDR)      (*(__IO uint16_t xdata *) PWMxT2_ADDR)  //!< PWMxT2 counter [PWMxT2H, PWMxT2L]
#define     PWMxCR(PWMxCR_ADDR)      (*(__IO uint8_t xdata *) PWMxCR_ADDR)  //!< PWMx control register
#define     PWMxHLD(PWMxHLD_ADDR)    (*(__IO uint8_t xdata *) PWMxHLD_ADDR) //!< PWMx level holder control register

#define     PWM0            ((PWMx_TypeDef xdata *) PWM0_BASE)          //!< PWM0 generic struct type
#define     PWM1            ((PWMx_TypeDef xdata *) PWM1_BASE)          //!< PWM1 generic struct type
#define     PWM2            ((PWMx_TypeDef xdata *) PWM2_BASE)          //!< PWM2 generic struct type
#define     PWM3            ((PWMx_TypeDef xdata *) PWM3_BASE)          //!< PWM3 generic struct type
#define     PWM4            ((PWMx_TypeDef xdata *) PWM4_BASE)          //!< PWM4 generic struct type
#define     PWM5            ((PWMx_TypeDef xdata *) PWM5_BASE)          //!< PWM5 generic struct type
#define     PWM6            ((PWMx_TypeDef xdata *) PWM6_BASE)          //!< PWM6 generic struct type
#define     PWM7            ((PWMx_TypeDef xdata *) PWM7_BASE)          //!< PWM7 generic struct type

#define     PWM0T1          (*(__IO uint16_t xdata *) PWM0T1_ADDR)
#define     PWM0T1H         (*(__IO uint8_t xdata *) PWM0T1H_ADDR)
#define     PWM0T1L         (*(__IO uint8_t xdata *) PWM0T1L_ADDR)
#define     PWM0T2          (*(__IO uint16_t xdata *) PWM0T2_ADDR)
#define     PWM0T2H         (*(__IO uint8_t xdata *) PWM0T2H_ADDR)
#define     PWM0T2L         (*(__IO uint8_t xdata *) PWM0T2L_ADDR)
#define     PWM0CR          (*(__IO uint8_t xdata *) PWM0CR_ADDR)
#define     PWM0HLD         (*(__IO uint8_t xdata *) PWM0HLD_ADDR)

#define     PWM1T1          (*(__IO uint16_t xdata *) PWM1T1_ADDR)
#define     PWM1T1H         (*(__IO uint8_t xdata *) PWM1T1H_ADDR)
#define     PWM1T1L         (*(__IO uint8_t xdata *) PWM1T1L_ADDR)
#define     PWM1T2          (*(__IO uint16_t xdata *) PWM1T2_ADDR)
#define     PWM1T2H         (*(__IO uint8_t xdata *) PWM1T2H_ADDR)
#define     PWM1T2L         (*(__IO uint8_t xdata *) PWM1T2L_ADDR)
#define     PWM1CR          (*(__IO uint8_t xdata *) PWM1CR_ADDR)
#define     PWM1HLD         (*(__IO uint8_t xdata *) PWM1HLD_ADDR)

