HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8hx.h
#define     PWM2T1          (*(__IO uint16_t xdata *) PWM2T1_ADDR)
#define     PWM2T1H         (*(__IO uint8_t xdata *) PWM2T1H_ADDR)
#define     PWM2T1L         (*(__IO uint8_t xdata *) PWM2T1L_ADDR)
#define     PWM2T2          (*(__IO uint16_t xdata *) PWM2T2_ADDR)
#define     PWM2T2H         (*(__IO uint8_t xdata *) PWM2T2H_ADDR)
#define     PWM2T2L         (*(__IO uint8_t xdata *) PWM2T2L_ADDR)
#define     PWM2CR          (*(__IO uint8_t xdata *) PWM2CR_ADDR)
#define     PWM2HLD         (*(__IO uint8_t xdata *) PWM2HLD_ADDR)

#define     PWM3T1          (*(__IO uint16_t xdata *) PWM3T1_ADDR)
#define     PWM3T1H         (*(__IO uint8_t xdata *) PWM3T1H_ADDR)
#define     PWM3T1L         (*(__IO uint8_t xdata *) PWM3T1L_ADDR)
#define     PWM3T2          (*(__IO uint16_t xdata *) PWM3T2_ADDR)
#define     PWM3T2H         (*(__IO uint8_t xdata *) PWM3T2H_ADDR)
#define     PWM3T2L         (*(__IO uint8_t xdata *) PWM3T2L_ADDR)
#define     PWM3CR          (*(__IO uint8_t xdata *) PWM3CR_ADDR)
#define     PWM3HLD         (*(__IO uint8_t xdata *) PWM3HLD_ADDR)

#define     PWM4T1          (*(__IO uint16_t xdata *) PWM4T1_ADDR)
#define     PWM4T1H         (*(__IO uint8_t xdata *) PWM4T1H_ADDR)
#define     PWM4T1L         (*(__IO uint8_t xdata *) PWM4T1L_ADDR)
#define     PWM4T2          (*(__IO uint16_t xdata *) PWM4T2_ADDR)
#define     PWM4T2H         (*(__IO uint8_t xdata *) PWM4T2H_ADDR)
#define     PWM4T2L         (*(__IO uint8_t xdata *) PWM4T2L_ADDR)
#define     PWM4CR          (*(__IO uint8_t xdata *) PWM4CR_ADDR)
#define     PWM4HLD         (*(__IO uint8_t xdata *) PWM4HLD_ADDR)

#define     PWM5T1          (*(__IO uint16_t xdata *) PWM5T1_ADDR)
#define     PWM5T1H         (*(__IO uint8_t xdata *) PWM5T1H_ADDR)
#define     PWM5T1L         (*(__IO uint8_t xdata *) PWM5T1L_ADDR)
#define     PWM5T2          (*(__IO uint16_t xdata *) PWM5T2_ADDR)
#define     PWM5T2H         (*(__IO uint8_t xdata *) PWM5T2H_ADDR)
#define     PWM5T2L         (*(__IO uint8_t xdata *) PWM5T2L_ADDR)
#define     PWM5CR          (*(__IO uint8_t xdata *) PWM5CR_ADDR)
#define     PWM5HLD         (*(__IO uint8_t xdata *) PWM5HLD_ADDR)

#define     PWM6T1          (*(__IO uint16_t xdata *) PWM6T1_ADDR)
#define     PWM6T1H         (*(__IO uint8_t xdata *) PWM6T1H_ADDR)
#define     PWM6T1L         (*(__IO uint8_t xdata *) PWM6T1L_ADDR)
#define     PWM6T2          (*(__IO uint16_t xdata *) PWM6T2_ADDR)
#define     PWM6T2H         (*(__IO uint8_t xdata *) PWM6T2H_ADDR)
#define     PWM6T2L         (*(__IO uint8_t xdata *) PWM6T2L_ADDR)
#define     PWM6CR          (*(__IO uint8_t xdata *) PWM6CR_ADDR)
#define     PWM6HLD         (*(__IO uint8_t xdata *) PWM6HLD_ADDR)

#define     PWM7T1          (*(__IO uint16_t xdata *) PWM7T1_ADDR)
#define     PWM7T1H         (*(__IO uint8_t xdata *) PWM7T1H_ADDR)
#define     PWM7T1L         (*(__IO uint8_t xdata *) PWM7T1L_ADDR)
#define     PWM7T2          (*(__IO uint16_t xdata *) PWM7T2_ADDR)
#define     PWM7T2H         (*(__IO uint8_t xdata *) PWM7T2H_ADDR)
#define     PWM7T2L         (*(__IO uint8_t xdata *) PWM7T2L_ADDR)
#define     PWM7CR          (*(__IO uint8_t xdata *) PWM7CR_ADDR)
#define     PWM7HLD         (*(__IO uint8_t xdata *) PWM7HLD_ADDR)

//! SPI peripherals
/**
 * @brief SPI general I/O interface
 */
typedef struct {
    __IO uint8_t SPSTAT;
    __IO uint8_t SPCTL;
    __IO uint8_t SPDAT;
}SPI_TypeDef;

/* SPI basic address definition */
#define     SPI_BASE        0xCD
#define     SPSTAT_ADDR     0xCD
#define     SPCTL_ADDR      0xCE
#define     SPDAT_ADDR      0xCF

/* Bit definition for SPSTAT register */
#define     SPSTAT_SPIF     0x80             /*!< SPI interrupt flag bit */
#define     SPSTAT_WCOL     0x40             /*!< SPI writing confliction flag bit */

/* Bit definition for SPCTL register */
#define     SPCTL_SSIG      0x80             /*!< SS fucntion selection: [0], use SS to determine slave or master; [1], use MSTR rather than SS */
#define     SPCTL_SPEN      0x40             /*!< SPI enabling control bit */
#define     SPCTL_DORD      0x20             /*!< SPI data sending/receiving order: [0], MSB; [1], LSB */
#define     SPCTL_MSTR      0x10             /*!< device mater or slave mode selection: [MASTER], SSIG=0, SS pin high, MSTR=1; SSIG=1, MSTR=1; [SLAVE], SSIG=0, SS pin low; SSIG=1, MSTR=0 */
#define     SPCTL_CPOL      0x08             /*!< SPI clock polarity control: [0] Sclk Idle Time is low level, SCLK front clock edge for the rising edge, after the clock edge for the falling edge; [1], Sclk idle time for high-level, SCLK front clock edge for the down edge, after the clock edge for the rising edge */
#define     SPCTL_CPHA      0x04             /*!< SPI clock phase control: [0], The data SS pin drives the first bit data for the low level and changes the data at the SCLK's back clock edge, and the front clock edge samples the data (must be SSIG = 0); [1], Data is sampled along the front clock edge of SCLK and the back clock edge */

#define     SPCTL_SPR       0x03             /*!< SPR[1:0], SPI clock frequency selection */
#define     SPCTL_SPR_0     0x01             /*!< Bit 0 */
#define     SPCTL_SPR_1     0x02             /*!< Bit 1 */

#define     SPCTL_SPR_SCLK_DIV4     0x00     /*!< SYSCLK/4 */
#define     SPCTL_SPR_SCLK_DIV8     0x01     /*!< SYSCLK/8 */
#define     SPCTL_SPR_SCLK_DIV16    0x02     /*!< SYSCLK/16 */
#define     SPCTL_SPR_SCLK_DIV32    0x03     /*!< SYSCLK/32 */

/**
 * @brief define the SPI_TypeDef pointer type
 * @note To access XDATA peripherals, use the \c volatile keyword to ensure 
 * that the C compiler does not optimize out necessary memory accesses. \n
 * \code{.c} ((SPI_TypeDef idata * xdata *) SPI_BASE) \endcode 
 * means \b SPI_TypeDef pointer is stored in \e xdata space but 
 * points to \e idata space. If you want to use this struct type, prefix 
 * \code{.c} (SPI_TypeDef idata *) \endcode is needed, such as 
 * \code{.c} (SPI_TypeDef idata *) var \endcode, in witch the
 * \c var is \b SPI_TypeDef .
 */
#define     SPI             (*((SPI_TypeDef idata* xdata* ) SPI_BASE))    //!< SPI generic struct type definition

