HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8hx.h
/* SPI special function registers */
sfr SPSTAT      =   SPSTAT_ADDR;        //!< SPI State Register
sfr SPCTL       =   SPCTL_ADDR;         //!< SPI Control Register
sfr SPDAT       =   SPDAT_ADDR;         //!< SPI Data Register

//! LCM peripherals
/**
 * @brief LCM general I/O configuration
 */
typedef struct {
    __IO uint8_t LCMIFCFG;
    __IO uint8_t LCMIFCFG2;
    __IO uint8_t LCMIFCR;
    __IO uint8_t LCMIFSTA;
    __IO uint8_t LCMIDDATL;
    __IO uint8_t LCMIDDATH;
} LCM_TypeDef;

/* Basic address */
#define     LCM_BASE          0xFE50
#define     LCMIFCFG_ADDR     (LCM_BASE + 0x0000)
#define     LCMIFCFG2_ADDR    (LCM_BASE + 0x0001)
#define     LCMIFCR_ADDR      (LCM_BASE + 0x0002)
#define     LCMIFSTA_ADDR     (LCM_BASE + 0x0003)
#define     LCMIDDATL_ADDR    (LCM_BASE + 0x0004)
#define     LCMIDDATH_ADDR    (LCM_BASE + 0x0005)

/* Bit definition for LCMIFCFG register */
#define     LCMIFCFG_LCMIFIE            0x80     /*!< LCM interface interrupt enable control bit: [0], disable; [1], enable */

#define     LCMIFCFG_LCMIFIP            0x30     /*!< LCMIFIP[1:0], LCM interface interrupt priority control bit */
#define     LCMIFCFG_LCMIFIP_0          0x10     /*!< BIT 0 */
#define     LCMIFCFG_LCMIFIP_1          0x20     /*!< BIT 1 */

#define     LCMIFCFG_LCMIFIP_LOWEST     0x10
#define     LCMIFCFG_LCMIFIP_LOW        0x10
#define     LCMIFCFG_LCMIFIP_HIGH       0x20
#define     LCMIFCFG_LCMIFIP_HIGHEST    0x30

#define     LCMIFCFG_LCMIFDPS           0xC0     /*!< LCMIFDPS[1:0], LCM interface data foot select bit */
#define     LCMIFCFG_LCMIFDPS_0         0x40     /*!< BIT 0 */
#define     LCMIFCFG_LCMIFDPS_1         0x80     /*!< BIT 1 */

#define     LCMIFCFG_D16_D8             0x02     /*!< LCM interface data width control bit: [0], 8-bit data width; [1], 16-bit data width  */

#define     LCMIFCFG_M68_I80            0x01     /*!< LCM interface mode selection bit: [0], I8080 Mode; [1], M6800 Mode */

/* Bit definition for LCMIFCFG2 register */
#define     LCMIFCFG2_LCMIFCPS          0x60     /*!< LCMIFCPS[1:0], LCM interface data foot select bit */
#define     LCMIFCFG2_LCMIFDPS_0        0x20     /*!< BIT 0 */
#define     LCMIFCFG2_LCMIFDPS_1        0x40     /*!< BIT 1 */

#define     LCMIFCFG2_SETUPT            0x1C     /*!< SETUPT[2:0], Data establishment time control bit of LCM interface communication */
#define     LCMIFCFG2_SETUPT_0          0x04     /*!< BIT 0 */
#define     LCMIFCFG2_SETUPT_1          0x08     /*!< BIT 1 */
#define     LCMIFCFG2_SETUPT_2          0x10     /*!< BIT 2 */

#define     LCMIFCFG2_HOLDT             0x03     /*!< HOLDT[1:0], Data hold time control bit for LCM interface communication */
#define     LCMIFCFG2_HOLDT_0           0x01     /*!< BIT 0 */
#define     LCMIFCFG2_HOLDT_1           0x02     /*!< BIT 1 */

/* Bit definition for LCMIFCR register */
#define     LCMIFCR_ELCMIF              0x80     /*!< The LCM interface enables the control bit, [0], disable; [1], enable */

#define     LCMIFCR_CMD                 0x07     /*!< CMD[2:0], The LCM interface triggers commands */
#define     LCMIFCR_CMD_0               0x01     /*!< BIT 0 */
#define     LCMIFCR_CMD_1               0x02     /*!< BIT 1 */
#define     LCMIFCR_CMD_2               0x04     /*!< BIT 2 */

#define     LCMIFCR_CMD_WRITE_CMD       0x04     /*!< Write commands */
#define     LCMIFCR_CMD_WRITE_DATA      0x05     /*!< Write data */
#define     LCMIFCR_CMD_READ            0x06     /*!< read commands or state */
#define     LCMIFCR_CMD_READ_DATA       0x07     /*!< read data */

/* Bit definition for LCMIFSTA register */
#define     LCMIFSTA_LCMIFIF             0x01     /*!< LCM interface interrupt request flag, software clear 0 */


#define     LCMIFCFG          (*(__IO uint8_t xdata *) LCMIFCFG_ADDR)    //!< LCM interface configuration register
#define     LCMIFCFG2         (*(__IO uint8_t xdata *) LCMIFCFG2_ADDR)   //!< LCM interface configuration register 2
#define     LCMIFCR           (*(__IO uint8_t xdata *) LCMIFCR_ADDR)     //!< LCM interface control register
#define     LCMIFSTA          (*(__IO uint8_t xdata *) LCMIFSTA_ADDR)    //!< LCM interface state register
#define     LCMIDDATL         (*(__IO uint8_t xdata *) LCMIDDATL_ADDR)   //!< LCM interface low-byte data
#define     LCMIDDATH         (*(__IO uint8_t xdata *) LCMIDDATH_ADDR)   //!< LCM interface High-byte data

//! DMA peripherals
/**
 * @brief BMM general I/O configuration
 */
struct BMM_General{
    __IO uint8_t CFG;
    __IO uint8_t CR;
    __IO uint8_t STA;
    __IO uint8_t AMT;
    __IO uint8_t DONE;
    __IO uint16_t TXA;
};

/**
 * @brief M2M_BMM I/O configuration
 */
struct M2M_BMM_struct{
    struct BMM_General* BMM;
    __IO uint16_t RXA;
};
#define M2M_BMM_TypeDef struct M2M_BMM_struct

/**
 * @brief ADC_BMM I/O configuration
 */
struct ADC_BMM_struct{
    struct BMM_General* BMM;
    __IO uint16_t RXA;
    __IO uint8_t CFG2;
    __IO uint8_t CHSW0;
    __IO uint8_t CHSW1;
}; 
#define ADC_BMM_TypeDef struct ADC_BMM_struct

/**
 * @brief SPI_BMM I/O configuration
 */
struct SPI_BMM_struct{
    struct BMM_General* BMM;
    __IO uint16_t RXA;
    __IO uint8_t CFG2;
}; 
#define SPI_BMM_TypeDef struct SPI_BMM_struct

/**
 * @brief UR1T_BMM I/O configuration
 */
#define UR1T_BMM_TypeDef struct BMM_General


/**
 * @brief UR1R_BMM I/O configuration
 */
#define UR1R_BMM_TypeDef struct BMM_General

/**
 * @brief UR2T_BMM I/O configuration
 */
#define UR2T_BMM_TypeDef struct BMM_General

/**
 * @brief UR2R_BMM I/O configuration
 */
#define UR2R_BMM_TypeDef struct BMM_General

/**
 * @brief UR3T_BMM I/O configuration
 */
#define UR3T_BMM_TypeDef struct BMM_General

/**
 * @brief UR3R_BMM I/O configuration
 */
#define UR3R_BMM_TypeDef struct BMM_General

/**
 * @brief UR4T_BMM I/O configuration
 */
#define UR4T_BMM_TypeDef struct BMM_General

/**
 * @brief UR4R_BMM I/O configuration
 */
#define UR4R_BMM_TypeDef struct BMM_General


/**
 * @brief LCM_BMM I/O configuration
 */
struct LCM_BMM_struct{
    struct BMM_General* BMM;
    __IO uint16_t RXA;
};
#define LCM_BMM_TypeDef struct LCM_BMM_struct

/* Basic address */
#define     M2M_BMM_BASE            0xFA00
#define     BMM_M2M_CFG_ADDR        (M2M_BMM_BASE + 0x0000)
#define     BMM_M2M_CR_ADDR         (M2M_BMM_BASE + 0x0001)
#define     BMM_M2M_STA_ADDR        (M2M_BMM_BASE + 0x0002)
#define     BMM_M2M_AMT_ADDR        (M2M_BMM_BASE + 0x0003)
#define     BMM_M2M_DONE_ADDR       (M2M_BMM_BASE + 0x0004)
#define     BMM_M2M_TXAH_ADDR       (M2M_BMM_BASE + 0x0005)
#define     BMM_M2M_TXAL_ADDR       (M2M_BMM_BASE + 0x0006)
#define     BMM_M2M_RXAH_ADDR       (M2M_BMM_BASE + 0x0007)
#define     BMM_M2M_RXAL_ADDR       (M2M_BMM_BASE + 0x0008)

#define     ADC_BMM_BASE            0xFA10
#define     BMM_ADC_CFG_ADDR        (ADC_BMM_BASE + 0x0000)
#define     BMM_ADC_CR_ADDR         (ADC_BMM_BASE + 0x0001)
#define     BMM_ADC_STA_ADDR        (ADC_BMM_BASE + 0x0002)
#define     BMM_ADC_AMT_ADDR        (ADC_BMM_BASE + 0x0003)
#define     BMM_ADC_DONE_ADDR       (ADC_BMM_BASE + 0x0004)
#define     BMM_ADC_TXAH_ADDR       (ADC_BMM_BASE + 0x0005)
#define     BMM_ADC_TXAL_ADDR       (ADC_BMM_BASE + 0x0006)
#define     BMM_ADC_RXAH_ADDR       (ADC_BMM_BASE + 0x0007)
#define     BMM_ADC_RXAL_ADDR       (ADC_BMM_BASE + 0x0008)
#define     BMM_ADC_CFG2_ADDR       (ADC_BMM_BASE + 0x0009)
#define     BMM_ADC_CHSW0_ADDR      (ADC_BMM_BASE + 0x000A)
#define     BMM_ADC_CHSW1_ADDR      (ADC_BMM_BASE + 0x000B)

