HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8hx.h
#define     SPI_BMM_BASE            0xFA20
#define     BMM_SPI_CFG_ADDR        (SPI_BMM_BASE + 0x0000)
#define     BMM_SPI_CR_ADDR         (SPI_BMM_BASE + 0x0001)
#define     BMM_SPI_STA_ADDR        (SPI_BMM_BASE + 0x0002)
#define     BMM_SPI_AMT_ADDR        (SPI_BMM_BASE + 0x0003)
#define     BMM_SPI_DONE_ADDR       (SPI_BMM_BASE + 0x0004)
#define     BMM_SPI_TXAH_ADDR       (SPI_BMM_BASE + 0x0005)
#define     BMM_SPI_TXAL_ADDR       (SPI_BMM_BASE + 0x0006)
#define     BMM_SPI_RXAH_ADDR       (SPI_BMM_BASE + 0x0007)
#define     BMM_SPI_RXAL_ADDR       (SPI_BMM_BASE + 0x0008)
#define     BMM_SPI_CFG2_ADDR       (SPI_BMM_BASE + 0x0009)

#define     UR1T_BMM_BASE           0xFA30
#define     BMM_UR1T_CFG_ADDR       (UR1T_BMM_BASE + 0x0000)
#define     BMM_UR1T_CR_ADDR        (UR1T_BMM_BASE + 0x0001)
#define     BMM_UR1T_STA_ADDR       (UR1T_BMM_BASE + 0x0002)
#define     BMM_UR1T_AMT_ADDR       (UR1T_BMM_BASE + 0x0003)
#define     BMM_UR1T_DONE_ADDR      (UR1T_BMM_BASE + 0x0004)
#define     BMM_UR1T_TXAH_ADDR      (UR1T_BMM_BASE + 0x0005)
#define     BMM_UR1T_TXAL_ADDR      (UR1T_BMM_BASE + 0x0006)

#define     UR1R_BMM_BASE           0xFA38
#define     BMM_UR1R_CFG_ADDR       (UR1R_BMM_BASE + 0x0000)
#define     BMM_UR1R_CR_ADDR        (UR1R_BMM_BASE + 0x0001)
#define     BMM_UR1R_STA_ADDR       (UR1R_BMM_BASE + 0x0002)
#define     BMM_UR1R_AMT_ADDR       (UR1R_BMM_BASE + 0x0003)
#define     BMM_UR1R_DONE_ADDR      (UR1R_BMM_BASE + 0x0004)
#define     BMM_UR1R_TXAH_ADDR      (UR1R_BMM_BASE + 0x0005)
#define     BMM_UR1R_TXAL_ADDR      (UR1R_BMM_BASE + 0x0006)

#define     UR2T_BMM_BASE           0xFA40
#define     BMM_UR2T_CFG_ADDR       (UR2T_BMM_BASE + 0x0000)
#define     BMM_UR2T_CR_ADDR        (UR2T_BMM_BASE + 0x0001)
#define     BMM_UR2T_STA_ADDR       (UR2T_BMM_BASE + 0x0002)
#define     BMM_UR2T_AMT_ADDR       (UR2T_BMM_BASE + 0x0003)
#define     BMM_UR2T_DONE_ADDR      (UR2T_BMM_BASE + 0x0004)
#define     BMM_UR2T_TXAH_ADDR      (UR2T_BMM_BASE + 0x0005)
#define     BMM_UR2T_TXAL_ADDR      (UR2T_BMM_BASE + 0x0006)

#define     UR2R_BMM_BASE           0xFA48
#define     BMM_UR2R_CFG_ADDR       (UR2R_BMM_BASE + 0x0000)
#define     BMM_UR2R_CR_ADDR        (UR2R_BMM_BASE + 0x0001)
#define     BMM_UR2R_STA_ADDR       (UR2R_BMM_BASE + 0x0002)
#define     BMM_UR2R_AMT_ADDR       (UR2R_BMM_BASE + 0x0003)
#define     BMM_UR2R_DONE_ADDR      (UR2R_BMM_BASE + 0x0004)
#define     BMM_UR2R_TXAH_ADDR      (UR2R_BMM_BASE + 0x0005)
#define     BMM_UR2R_TXAL_ADDR      (UR2R_BMM_BASE + 0x0006)

#define     UR3T_BMM_BASE           0xFA50
#define     BMM_UR3T_CFG_ADDR       (UR3T_BMM_BASE + 0x0000)
#define     BMM_UR3T_CR_ADDR        (UR3T_BMM_BASE + 0x0001)
#define     BMM_UR3T_STA_ADDR       (UR3T_BMM_BASE + 0x0002)
#define     BMM_UR3T_AMT_ADDR       (UR3T_BMM_BASE + 0x0003)
#define     BMM_UR3T_DONE_ADDR      (UR3T_BMM_BASE + 0x0004)
#define     BMM_UR3T_TXAH_ADDR      (UR3T_BMM_BASE + 0x0005)
#define     BMM_UR3T_TXAL_ADDR      (UR3T_BMM_BASE + 0x0006)

#define     UR3R_BMM_BASE           0xFA58
#define     BMM_UR3R_CFG_ADDR       (UR3R_BMM_BASE + 0x0000)
#define     BMM_UR3R_CR_ADDR        (UR3R_BMM_BASE + 0x0001)
#define     BMM_UR3R_STA_ADDR       (UR3R_BMM_BASE + 0x0002)
#define     BMM_UR3R_AMT_ADDR       (UR3R_BMM_BASE + 0x0003)
#define     BMM_UR3R_DONE_ADDR      (UR3R_BMM_BASE + 0x0004)
#define     BMM_UR3R_TXAH_ADDR      (UR3R_BMM_BASE + 0x0005)
#define     BMM_UR3R_TXAL_ADDR      (UR3R_BMM_BASE + 0x0006)

#define     UR4T_BMM_BASE           0xFA60
#define     BMM_UR4T_CFG_ADDR       (UR4T_BMM_BASE + 0x0000)
#define     BMM_UR4T_CR_ADDR        (UR4T_BMM_BASE + 0x0001)
#define     BMM_UR4T_STA_ADDR       (UR4T_BMM_BASE + 0x0002)
#define     BMM_UR4T_AMT_ADDR       (UR4T_BMM_BASE + 0x0003)
#define     BMM_UR4T_DONE_ADDR      (UR4T_BMM_BASE + 0x0004)
#define     BMM_UR4T_TXAH_ADDR      (UR4T_BMM_BASE + 0x0005)
#define     BMM_UR4T_TXAL_ADDR      (UR4T_BMM_BASE + 0x0006)

#define     UR4R_BMM_BASE           0xFA68
#define     BMM_UR4R_CFG_ADDR       (UR4R_BMM_BASE + 0x0000)
#define     BMM_UR4R_CR_ADDR        (UR4R_BMM_BASE + 0x0001)
#define     BMM_UR4R_STA_ADDR       (UR4R_BMM_BASE + 0x0002)
#define     BMM_UR4R_AMT_ADDR       (UR4R_BMM_BASE + 0x0003)
#define     BMM_UR4R_DONE_ADDR      (UR4R_BMM_BASE + 0x0004)
#define     BMM_UR4R_TXAH_ADDR      (UR4R_BMM_BASE + 0x0005)
#define     BMM_UR4R_TXAL_ADDR      (UR4R_BMM_BASE + 0x0006)

#define     LCM_BMM_BASE            0xFA70
#define     BMM_LCM_CFG_ADDR        (LCM_BMM_BASE + 0x0000)
#define     BMM_LCM_CR_ADDR         (LCM_BMM_BASE + 0x0001)
#define     BMM_LCM_STA_ADDR        (LCM_BMM_BASE + 0x0002)
#define     BMM_LCM_AMT_ADDR        (LCM_BMM_BASE + 0x0003)
#define     BMM_LCM_DONE_ADDR       (LCM_BMM_BASE + 0x0004)
#define     BMM_LCM_TXAH_ADDR       (LCM_BMM_BASE + 0x0005)
#define     BMM_LCM_TXAL_ADDR       (LCM_BMM_BASE + 0x0006)
#define     BMM_LCM_RXAH_ADDR       (LCM_BMM_BASE + 0x0007)
#define     BMM_LCM_RXAL_ADDR       (LCM_BMM_BASE + 0x0008)


/* BMM special function registers */
#define     BMM_M2M_CFG             (*(__IO uint8_t xdata *) BMM_M2M_CFG_ADDR)      //! configuration register
#define     BMM_M2M_CR              (*(__IO uint8_t xdata *) BMM_M2M_CR_ADDR)       //! control register
#define     BMM_M2M_STA             (*(__IO uint8_t xdata *) BMM_M2M_STA_ADDR)      //! state register
#define     BMM_M2M_AMT             (*(__IO uint8_t xdata *) BMM_M2M_AMT_ADDR)      //! total transfer bytes register
#define     BMM_M2M_DONE            (*(__IO uint8_t xdata *) BMM_M2M_DONE_ADDR)     //! Transfer completed bytes register
#define     BMM_M2M_TXA             (*(__IO uint16_t xdata *) BMM_M2M_TXAH_ADDR)    //! Send address
#define     BMM_M2M_TXAH            (*(__IO uint8_t xdata *) BMM_M2M_TXAH_ADDR)     //! Send High address
#define     BMM_M2M_TXAL            (*(__IO uint8_t xdata *) BMM_M2M_TXAL_ADDR)     //! Send Low address
#define     BMM_M2M_RXA             (*(__IO uint16_t xdata *) BMM_M2M_RXAH_ADDR)    //! Reveice address
#define     BMM_M2M_RXAH            (*(__IO uint8_t xdata *) BMM_M2M_RXAH_ADDR)     //! Reveice High address
#define     BMM_M2M_RXAL            (*(__IO uint8_t xdata *) BMM_M2M_RXAL_ADDR)     //! Reveice Low address

#define     BMM_ADC_CFG             (*(__IO uint8_t xdata *) BMM_ADC_CFG_ADDR)
#define     BMM_ADC_CR              (*(__IO uint8_t xdata *) BMM_ADC_CR_ADDR)
#define     BMM_ADC_STA             (*(__IO uint8_t xdata *) BMM_ADC_STA_ADDR)
#define     BMM_ADC_AMT             (*(__IO uint8_t xdata *) BMM_ADC_AMT_ADDR)
#define     BMM_ADC_DONE            (*(__IO uint8_t xdata *) BMM_ADC_DONE_ADDR)
#define     BMM_ADC_TXA             (*(__IO uint16_t xdata *) BMM_ADC_TXAH_ADDR)
#define     BMM_ADC_TXAH            (*(__IO uint8_t xdata *) BMM_ADC_TXAH_ADDR)
#define     BMM_ADC_TXAL            (*(__IO uint8_t xdata *) BMM_ADC_TXAL_ADDR)
#define     BMM_ADC_RXA             (*(__IO uint16_t xdata *) BMM_ADC_RXAH_ADDR)
#define     BMM_ADC_RXAH            (*(__IO uint8_t xdata *) BMM_ADC_RXAH_ADDR)
#define     BMM_ADC_RXAL            (*(__IO uint8_t xdata *) BMM_ADC_RXAL_ADDR)
#define     BMM_ADC_CFG2            (*(__IO uint8_t xdata *) BMM_ADC_CFG2_ADDR)
#define     BMM_ADC_CHSW0           (*(__IO uint8_t xdata *) BMM_ADC_CHSW0_ADDR)
#define     BMM_ADC_CHSW1           (*(__IO uint8_t xdata *) BMM_ADC_CHSW1_ADDR)

#define     BMM_SPI_CFG             (*(__IO uint8_t xdata *) BMM_SPI_CFG_ADDR)
#define     BMM_SPI_CR              (*(__IO uint8_t xdata *) BMM_SPI_CR_ADDR)
#define     BMM_SPI_STA             (*(__IO uint8_t xdata *) BMM_SPI_STA_ADDR)
#define     BMM_SPI_AMT             (*(__IO uint8_t xdata *) BMM_SPI_AMT_ADDR)
#define     BMM_SPI_DONE            (*(__IO uint8_t xdata *) BMM_SPI_DONE_ADDR)
#define     BMM_SPI_TXA             (*(__IO uint16_t xdata *) BMM_SPI_TXAH_ADDR)
#define     BMM_SPI_TXAH            (*(__IO uint8_t xdata *) BMM_SPI_TXAH_ADDR)
#define     BMM_SPI_TXAL            (*(__IO uint8_t xdata *) BMM_SPI_TXAL_ADDR)
#define     BMM_SPI_RXA             (*(__IO uint16_t xdata *) BMM_SPI_RXAH_ADDR)
#define     BMM_SPI_RXAH            (*(__IO uint8_t xdata *) BMM_SPI_RXAH_ADDR)
#define     BMM_SPI_RXAL            (*(__IO uint8_t xdata *) BMM_SPI_RXAL_ADDR)
#define     BMM_SPI_CFG2            (*(__IO uint8_t xdata *) BMM_SPI_CFG2_ADDR)

#define     BMM_UR1T_CFG            (*(__IO uint8_t xdata *) BMM_UR1T_CFG_ADDR)
#define     BMM_UR1T_CR             (*(__IO uint8_t xdata *) BMM_UR1T_CR_ADDR)
#define     BMM_UR1T_STA            (*(__IO uint8_t xdata *) BMM_UR1T_STA_ADDR)
#define     BMM_UR1T_AMT            (*(__IO uint8_t xdata *) BMM_UR1T_AMT_ADDR)
#define     BMM_UR1T_DONE           (*(__IO uint8_t xdata *) BMM_UR1T_DONE_ADDR)
#define     BMM_UR1T_TXA            (*(__IO uint16_t xdata *) BMM_UR1T_TXAH_ADDR)
#define     BMM_UR1T_TXAH           (*(__IO uint8_t xdata *) BMM_UR1T_TXAH_ADDR)
#define     BMM_UR1T_TXAL           (*(__IO uint8_t xdata *) BMM_UR1T_TXAL_ADDR)

#define     BMM_UR1R_CFG            (*(__IO uint8_t xdata *) BMM_UR1R_CFG_ADDR)
#define     BMM_UR1R_CR             (*(__IO uint8_t xdata *) BMM_UR1R_CR_ADDR)
#define     BMM_UR1R_STA            (*(__IO uint8_t xdata *) BMM_UR1R_STA_ADDR)
#define     BMM_UR1R_AMT            (*(__IO uint8_t xdata *) BMM_UR1R_AMT_ADDR)
#define     BMM_UR1R_DONE           (*(__IO uint8_t xdata *) BMM_UR1R_DONE_ADDR)
#define     BMM_UR1R_TXA            (*(__IO uint16_t xdata *) BMM_UR1R_TXAH_ADDR)
#define     BMM_UR1R_TXAH           (*(__IO uint8_t xdata *) BMM_UR1R_TXAH_ADDR)
#define     BMM_UR1R_TXAL           (*(__IO uint8_t xdata *) BMM_UR1R_TXAL_ADDR)

