HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8hx.h
#define     BMM_UR2T_CFG            (*(__IO uint8_t xdata *) BMM_UR2T_CFG_ADDR)
#define     BMM_UR2T_CR             (*(__IO uint8_t xdata *) BMM_UR2T_CR_ADDR)
#define     BMM_UR2T_STA            (*(__IO uint8_t xdata *) BMM_UR2T_STA_ADDR)
#define     BMM_UR2T_AMT            (*(__IO uint8_t xdata *) BMM_UR2T_AMT_ADDR)
#define     BMM_UR2T_DONE           (*(__IO uint8_t xdata *) BMM_UR2T_DONE_ADDR)
#define     BMM_UR2T_TXA            (*(__IO uint16_t xdata *) BMM_UR2T_TXAH_ADDR)
#define     BMM_UR2T_TXAH           (*(__IO uint8_t xdata *) BMM_UR2T_TXAH_ADDR)
#define     BMM_UR2T_TXAL           (*(__IO uint8_t xdata *) BMM_UR2T_TXAL_ADDR)

#define     BMM_UR2R_CFG            (*(__IO uint8_t xdata *) BMM_UR2R_CFG_ADDR)
#define     BMM_UR2R_CR             (*(__IO uint8_t xdata *) BMM_UR2R_CR_ADDR)
#define     BMM_UR2R_STA            (*(__IO uint8_t xdata *) BMM_UR2R_STA_ADDR)
#define     BMM_UR2R_AMT            (*(__IO uint8_t xdata *) BMM_UR2R_AMT_ADDR)
#define     BMM_UR2R_DONE           (*(__IO uint8_t xdata *) BMM_UR2R_DONE_ADDR)
#define     BMM_UR2R_TXA            (*(__IO uint16_t xdata *) BMM_UR2R_TXAH_ADDR)
#define     BMM_UR2R_TXAH           (*(__IO uint8_t xdata *) BMM_UR2R_TXAH_ADDR)
#define     BMM_UR2R_TXAL           (*(__IO uint8_t xdata *) BMM_UR2R_TXAL_ADDR)

#define     BMM_UR3T_CFG            (*(__IO uint8_t xdata *) BMM_UR3T_CFG_ADDR)
#define     BMM_UR3T_CR             (*(__IO uint8_t xdata *) BMM_UR3T_CR_ADDR)
#define     BMM_UR3T_STA            (*(__IO uint8_t xdata *) BMM_UR3T_STA_ADDR)
#define     BMM_UR3T_AMT            (*(__IO uint8_t xdata *) BMM_UR3T_AMT_ADDR)
#define     BMM_UR3T_DONE           (*(__IO uint8_t xdata *) BMM_UR3T_DONE_ADDR)
#define     BMM_UR3T_TXA            (*(__IO uint16_t xdata *) BMM_UR3T_TXAH_ADDR)
#define     BMM_UR3T_TXAH           (*(__IO uint8_t xdata *) BMM_UR3T_TXAH_ADDR)
#define     BMM_UR3T_TXAL           (*(__IO uint8_t xdata *) BMM_UR3T_TXAL_ADDR)

#define     BMM_UR3R_CFG            (*(__IO uint8_t xdata *) BMM_UR3R_CFG_ADDR)
#define     BMM_UR3R_CR             (*(__IO uint8_t xdata *) BMM_UR3R_CR_ADDR)
#define     BMM_UR3R_STA            (*(__IO uint8_t xdata *) BMM_UR3R_STA_ADDR)
#define     BMM_UR3R_AMT            (*(__IO uint8_t xdata *) BMM_UR3R_AMT_ADDR)
#define     BMM_UR3R_DONE           (*(__IO uint8_t xdata *) BMM_UR3R_DONE_ADDR)
#define     BMM_UR3R_TXA            (*(__IO uint16_t xdata *) BMM_UR3R_TXAH_ADDR)
#define     BMM_UR3R_TXAH           (*(__IO uint8_t xdata *) BMM_UR3R_TXAH_ADDR)
#define     BMM_UR3R_TXAL           (*(__IO uint8_t xdata *) BMM_UR3R_TXAL_ADDR)

#define     BMM_UR4T_CFG            (*(__IO uint8_t xdata *) BMM_UR4T_CFG_ADDR)
#define     BMM_UR4T_CR             (*(__IO uint8_t xdata *) BMM_UR4T_CR_ADDR)
#define     BMM_UR4T_STA            (*(__IO uint8_t xdata *) BMM_UR4T_STA_ADDR)
#define     BMM_UR4T_AMT            (*(__IO uint8_t xdata *) BMM_UR4T_AMT_ADDR)
#define     BMM_UR4T_DONE           (*(__IO uint8_t xdata *) BMM_UR4T_DONE_ADDR)
#define     BMM_UR4T_TXA            (*(__IO uint16_t xdata *) BMM_UR4T_TXAH_ADDR)
#define     BMM_UR4T_TXAH           (*(__IO uint8_t xdata *) BMM_UR4T_TXAH_ADDR)
#define     BMM_UR4T_TXAL           (*(__IO uint8_t xdata *) BMM_UR4T_TXAL_ADDR)

#define     BMM_UR4R_CFG            (*(__IO uint8_t xdata *) BMM_UR4R_CFG_ADDR)
#define     BMM_UR4R_CR             (*(__IO uint8_t xdata *) BMM_UR4R_CR_ADDR)
#define     BMM_UR4R_STA            (*(__IO uint8_t xdata *) BMM_UR4R_STA_ADDR)
#define     BMM_UR4R_AMT            (*(__IO uint8_t xdata *) BMM_UR4R_AMT_ADDR)
#define     BMM_UR4R_DONE           (*(__IO uint8_t xdata *) BMM_UR4R_DONE_ADDR)
#define     BMM_UR4R_TXA            (*(__IO uint16_t xdata *) BMM_UR4R_TXAH_ADDR)
#define     BMM_UR4R_TXAH           (*(__IO uint8_t xdata *) BMM_UR4R_TXAH_ADDR)
#define     BMM_UR4R_TXAL           (*(__IO uint8_t xdata *) BMM_UR4R_TXAL_ADDR)

#define     BMM_LCM_CFG             (*(__IO uint8_t xdata *) BMM_LCM_CFG_ADDR)
#define     BMM_LCM_CR              (*(__IO uint8_t xdata *) BMM_LCM_CR_ADDR)
#define     BMM_LCM_STA             (*(__IO uint8_t xdata *) BMM_LCM_STA_ADDR)
#define     BMM_LCM_AMT             (*(__IO uint8_t xdata *) BMM_LCM_AMT_ADDR)
#define     BMM_LCM_DONE            (*(__IO uint8_t xdata *) BMM_LCM_DONE_ADDR)
#define     BMM_LCM_TXA             (*(__IO uint16_t xdata *) BMM_LCM_TXAH_ADDR)
#define     BMM_LCM_TXAH            (*(__IO uint8_t xdata *) BMM_LCM_TXAH_ADDR)
#define     BMM_LCM_TXAL            (*(__IO uint8_t xdata *) BMM_LCM_TXAL_ADDR)
#define     BMM_LCM_RXA             (*(__IO uint16_t xdata *) BMM_LCM_RXAH_ADDR)
#define     BMM_LCM_RXAH            (*(__IO uint8_t xdata *) BMM_LCM_RXAH_ADDR)
#define     BMM_LCM_RXAL            (*(__IO uint8_t xdata *) BMM_LCM_RXAL_ADDR)

/* general structure I/O */
#define     M2M_BMM                 ((M2M_BMM_TypeDef xdata *) M2M_BMM_BASE)
#define     ADC_BMM                 ((ADC_BMM_TypeDef xdata *) ADC_BMM_BASE)
#define     SPI_BMM                 ((SPI_BMM_TypeDef xdata *) SPI_BMM_BASE)
#define     UR1T_BMM                ((UR1T_BMM_TypeDef xdata *) UR1T_BMM_BASE)
#define     UR1R_BMM                ((UR1R_BMM_TypeDef xdata *) UR1R_BMM_BASE)
#define     UR2T_BMM                ((UR2T_BMM_TypeDef xdata *) UR2T_BMM_BASE)
#define     UR2R_BMM                ((UR2R_BMM_TypeDef xdata *) UR2R_BMM_BASE)
#define     UR3T_BMM                ((UR3T_BMM_TypeDef xdata *) UR3T_BMM_BASE)
#define     UR3R_BMM                ((UR3R_BMM_TypeDef xdata *) UR3R_BMM_BASE)
#define     UR4T_BMM                ((UR4T_BMM_TypeDef xdata *) UR4T_BMM_BASE)
#define     UR4R_BMM                ((UR4R_BMM_TypeDef xdata *) UR4R_BMM_BASE)
#define     LCM_BMM                 ((LCM_BMM_TypeDef xdata *) LCM_BMM_BASE)

/* Bit definition for BMM_M2M_CFG register */
#define     BMM_M2M_CFG_M2MIE           0x80         /*!< Interrupt enable control bit: [0], disable; [1], enable */
#define     BMM_M2M_CFG_TXACO           0x20         /*!< The source address (read address) changes direction: [0], addr increase; [1], addr decrease */
#define     BMM_M2M_CFG_RXACO           0x10         /*!< The target address (write address) changes direction: [0], addr increase; [1], addr decrease */

#define     BMM_M2M_CFG_M2MIP           0x0C         /*!< M2MIP[1:0], Interrupt priority control bit */
#define     BMM_M2M_CFG_M2MIP_0         0x04         /*!< Bit 0 */
#define     BMM_M2M_CFG_M2MIP_1         0x08         /*!< Bit 1 */

#define     BMM_M2M_CFG_M2MIP_LOWEST    0x00
#define     BMM_M2M_CFG_M2MIP_LOW       0x04
#define     BMM_M2M_CFG_M2MIP_HIGH      0x08
#define     BMM_M2M_CFG_M2MIP_HIGHEST   0x0C


#define     BMM_M2M_CFG_M2MPTY          0x03         /*!< M2MPTY[1:0], Data bus access priority control bit */
#define     BMM_M2M_CFG_M2MPTY_0        0x01         /*!< Bit 0 */
#define     BMM_M2M_CFG_M2MPTY_1        0x02         /*!< Bit 1 */

#define     BMM_M2M_CFG_M2MPTY_LOWEST   0x00
#define     BMM_M2M_CFG_M2MPTY_LOW      0x01
#define     BMM_M2M_CFG_M2MPTY_HIGH     0x02
#define     BMM_M2M_CFG_M2MPTY_HIGHEST  0x03

/* Bit definition for BMM_M2M_CR register */
#define     BMM_M2M_CR_ENM2M            0x80         /*!< function enable control bit: [0], disable; [1], enable */
#define     BMM_M2M_CR_TRIG             0x40         /*!< Data read write trigger control bit: [0], disable; [1], enable */

/* Bit definition for BMM_M2M_STA register */
#define     BMM_M2M_STA_M2MIF           0x01         /*!< M2M interrupt request flag bit, when M2M operation is completed, the hardware automatically places M2MIF 1; software clearence */




/* Bit definition for BMM_ADC_CFG register */
#define     BMM_ADC_CFG_ADCIE           0x80         /*!< Interrupt enable control bit: [0], disable; [1], enable */

