HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8hx.h
#define     BMM_ADC_CFG_ADCIP           0x0C         /*!< ADCIP[1:0], Interrupt priority control bit */
#define     BMM_ADC_CFG_ADCIP_0         0x04         /*!< Bit 0 */
#define     BMM_ADC_CFG_ADCIP_1         0x08         /*!< Bit 1 */

#define     BMM_ADC_CFG_ADCIP_LOWEST    0x00
#define     BMM_ADC_CFG_ADCIP_LOW       0x04
#define     BMM_ADC_CFG_ADCIP_HIGH      0x08
#define     BMM_ADC_CFG_ADCIP_HIGHEST   0x0C


#define     BMM_ADC_CFG_ADCPTY          0x03         /*!< ADCPTY[1:0], Data bus access priority control bit */
#define     BMM_ADC_CFG_ADCPTY_0        0x01         /*!< Bit 0 */
#define     BMM_ADC_CFG_ADCPTY_1        0x02         /*!< Bit 1 */

#define     BMM_ADC_CFG_ADCPTY_LOWEST   0x00
#define     BMM_ADC_CFG_ADCPTY_LOW      0x01
#define     BMM_ADC_CFG_ADCPTY_HIGH     0x02
#define     BMM_ADC_CFG_ADCPTY_HIGHEST  0x03


/* Bit definition for BMM_ADC_CR register */
#define     BMM_ADC_CR_ENADC            0x80         /*!< function enable control bit: [0], disable; [1], enable */
#define     BMM_ADC_CR_TRIG             0x40         /*!< Data read write trigger control bit: [0], disable; [1], enable */

/* Bit definition for BMM_ADC_STA register */
#define     BMM_ADC_STA_ADCIF           0x01         /*!< ADC interrupt request flag bit, when ADC operation is completed, the hardware automatically places ADCIF 1; software clearence */

/* Bit definition for BMM_ADC_CFG2 register */
#define     BMM_ADC_CFG2_CVTIMESEL      0x0F         /*!< CVTIMESEL[3:0], Sets the number of ADC conversions per ADC channel when ADC operations are performed */
#define     BMM_ADC_CFG2_CVTIMESEL_0    0x01         /*!< Bit 0 */
#define     BMM_ADC_CFG2_CVTIMESEL_1    0x02         /*!< Bit 1 */
#define     BMM_ADC_CFG2_CVTIMESEL_2    0x04         /*!< Bit 2 */
#define     BMM_ADC_CFG2_CVTIMESEL_3    0x08         /*!< Bit 3 */

#define     BMM_ADC_CFG2_CVTIMESEL_CONT1     0x07    /*!< Conversion Times 1 */
#define     BMM_ADC_CFG2_CVTIMESEL_CONT2     0x08    /*!< Conversion Times 2 */
#define     BMM_ADC_CFG2_CVTIMESEL_CONT4     0x09    /*!< Conversion Times 4 */
#define     BMM_ADC_CFG2_CVTIMESEL_CONT8     0x0A    /*!< Conversion Times 8 */
#define     BMM_ADC_CFG2_CVTIMESEL_CONT16    0x0B    /*!< Conversion Times 16 */
#define     BMM_ADC_CFG2_CVTIMESEL_CONT32    0x0C    /*!< Conversion Times 32 */
#define     BMM_ADC_CFG2_CVTIMESEL_CONT64    0x0D    /*!< Conversion Times 64 */
#define     BMM_ADC_CFG2_CVTIMESEL_CONT128   0x0E    /*!< Conversion Times 128 */
#define     BMM_ADC_CFG2_CVTIMESEL_CONT256   0x0F    /*!< Conversion Times 256 */

/* Bit definition for BMM_ADC_CHSW0 register */
#define     BMM_ADC_CHSW0_CH15          0x80
#define     BMM_ADC_CHSW0_CH14          0x40
#define     BMM_ADC_CHSW0_CH13          0x20
#define     BMM_ADC_CHSW0_CH12          0x10
#define     BMM_ADC_CHSW0_CH11          0x08
#define     BMM_ADC_CHSW0_CH10          0x04
#define     BMM_ADC_CHSW0_CH9           0x02
#define     BMM_ADC_CHSW0_CH8           0x01

/* Bit definition for BMM_ADC_CHSW1 register */
#define     BMM_ADC_CHSW1_CH7           0x80
#define     BMM_ADC_CHSW1_CH6           0x40
#define     BMM_ADC_CHSW1_CH5           0x20
#define     BMM_ADC_CHSW1_CH4           0x10
#define     BMM_ADC_CHSW1_CH3           0x08
#define     BMM_ADC_CHSW1_CH2           0x04
#define     BMM_ADC_CHSW1_CH1           0x02
#define     BMM_ADC_CHSW1_CH0           0x01



/* Bit definition for BMM_SPI_CFG register */
#define     BMM_SPI_CFG_SPIIE           0x80         /*!< Interrupt enable control bit: [0], disable; [1], enable */

#define     BMM_SPI_CFG_ACT_TX          0x40         /*!< Send data control bit: [0], disable; [1], enable */

#define     BMM_SPI_CFG_ACT_RX          0x20         /*!< Receive data control bit: [0], disable; [1], enable */


#define     BMM_SPI_CFG_SPIIP           0x0C         /*!< SPIIP[1:0], Interrupt priority control bit */
#define     BMM_SPI_CFG_SPIIP_0         0x04         /*!< Bit 0 */
#define     BMM_SPI_CFG_SPIIP_1         0x08         /*!< Bit 1 */

#define     BMM_SPI_CFG_SPIIP_LOWEST    0x00
#define     BMM_SPI_CFG_SPIIP_LOW       0x04
#define     BMM_SPI_CFG_SPIIP_HIGH      0x08
#define     BMM_SPI_CFG_SPIIP_HIGHEST   0x0C


#define     BMM_SPI_CFG_SPIPTY          0x03         /*!< SPIPTY[1:0], Data bus access priority control bit */
#define     BMM_SPI_CFG_SPIPTY_0        0x01         /*!< Bit 0 */
#define     BMM_SPI_CFG_SPIPTY_1        0x02         /*!< Bit 1 */

#define     BMM_SPI_CFG_SPIPTY_LOWEST   0x00
#define     BMM_SPI_CFG_SPIPTY_LOW      0x01
#define     BMM_SPI_CFG_SPIPTY_HIGH     0x02
#define     BMM_SPI_CFG_SPIPTY_HIGHEST  0x03

/* Bit definition for BMM_SPI_CR register */
#define     BMM_SPI_CR_ENSPI            0x80         /*!< function enable control bit: [0], disable; [1], enable */

#define     BMM_SPI_CR_TRIG_M           0x40         /*!< Master mode trigger control bit: [0], disable; [1], enable */
 
#define     BMM_SPI_CR_TRIG_S           0x20         /*!< Slave mode trigger control bit: [0], disable; [1], enable */

#define     BMM_SPI_CR_CLRFIFO          0x01         /*!< Clear SPI_BMM receiving FIFO control bit: [0], disable; [1], enable */

/* Bit definition for BMM_SPI_STA register */
#define     BMM_SPI_STA_SPIIF           0x01         /*!< SPI interrupt request flag bit, when SPI operation is completed, the hardware automatically places SPIIF 1; software clearence */

#define     BMM_SPI_STA_RXLOSS          0x02         /*!< Receive data discard flag bit */

#define     BMM_SPI_STA_TXOVW           0x04         /*!< Data overwrite flag bit */

/* Bit definition for BMM_SPI_CFG2 register */
#define     BMM_SPI_CFG2_WRPSS          0x04         /*!< SS pin enable control bit: [0], disable; [1], enable automatically pull down SS before transmission complete */

#define     BMM_SPI_CFG2_SSS            0x03         /*!< SSS[1:0], During the SPI_BMM process, automatic control SS select bit */
#define     BMM_SPI_CFG2_SSS_0          0x01         /*!< Bit 0 */
#define     BMM_SPI_CFG2_SSS_1          0x02         /*!< Bit 1 */

