HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8hx.h
#define     BMM_SPI_CFG2_SSS_P12        0x00
#define     BMM_SPI_CFG2_SSS_P22        0x01
#define     BMM_SPI_CFG2_SSS_P74        0x02
#define     BMM_SPI_CFG2_SSS_P35        0x03




/* Bit definition for BMM_UR1T_CFG register */
#define     BMM_UR1T_CFG_UR1TIE             0x80         /*!< Interrupt enable control bit: [0], disable; [1], enable */

#define     BMM_UR1T_CFG_UR1TIP             0x0C         /*!< UR1TIP[1:0], Interrupt priority control bit */
#define     BMM_UR1T_CFG_UR1TIP_0           0x04         /*!< Bit 0 */
#define     BMM_UR1T_CFG_UR1TIP_1           0x08         /*!< Bit 1 */

#define     BMM_UR1T_CFG_UR1TIP_LOWEST      0x00
#define     BMM_UR1T_CFG_UR1TIP_LOW         0x04
#define     BMM_UR1T_CFG_UR1TIP_HIGH        0x08
#define     BMM_UR1T_CFG_UR1TIP_HIGHEST     0x0C


#define     BMM_UR1T_CFG_UR1TPTY            0x03         /*!< UR1TPTY[1:0], Data bus access priority control bit */
#define     BMM_UR1T_CFG_UR1TPTY_0          0x01         /*!< Bit 0 */
#define     BMM_UR1T_CFG_UR1TPTY_1          0x02         /*!< Bit 1 */

#define     BMM_UR1T_CFG_UR1TPTY_LOWES      0x00
#define     BMM_UR1T_CFG_UR1TPTY_LOW        0x01
#define     BMM_UR1T_CFG_UR1TPTY_HIGH       0x02
#define     BMM_UR1T_CFG_UR1TPTY_HIGHEST    0x03

/* Bit definition for BMM_UR1T_CR register */
#define     BMM_UR1T_CR_ENUR1T              0x80         /*!< function enable control bit: [0], disable; [1], enable */
#define     BMM_UR1T_CR_TRIG                0x40         /*!< Data read write trigger control bit: [0], disable; [1], enable */

/* Bit definition for BMM_UR1T_STA register */
#define     BMM_UR1T_STA_UR1TIF             0x01         /*!< UR1T interrupt request flag bit, when UR1T operation is completed, the hardware automatically places UR1TIF 1; software clearence */

#define     BMM_UR1T_STA_TXOVW              0x04         /*!< Data overwrite flag bit */



/* Bit definition for BMM_UR1R_CFG register */
#define     BMM_UR1R_CFG_UR1RIE             0x80         /*!< Interrupt enable control bit: [0], disable; [1], enable */

#define     BMM_UR1R_CFG_UR1RIP             0x0C         /*!< UR1RIP[1:0], Interrupt priority control bit */
#define     BMM_UR1R_CFG_UR1RIP_0           0x04         /*!< Bit 0 */
#define     BMM_UR1R_CFG_UR1RIP_1           0x08         /*!< Bit 1 */

#define     BMM_UR1R_CFG_UR1RIP_LOWEST      0x00
#define     BMM_UR1R_CFG_UR1RIP_LOW         0x04
#define     BMM_UR1R_CFG_UR1RIP_HIGH        0x08
#define     BMM_UR1R_CFG_UR1RIP_HIGHEST     0x0C


#define     BMM_UR1R_CFG_UR1RPTY            0x03         /*!< UR1RPTY[1:0], Data bus access priority control bit */
#define     BMM_UR1R_CFG_UR1RPTY_0          0x01         /*!< Bit 0 */
#define     BMM_UR1R_CFG_UR1RPTY_1          0x02         /*!< Bit 1 */

#define     BMM_UR1R_CFG_UR1RPTY_LOWES      0x00
#define     BMM_UR1R_CFG_UR1RPTY_LOW        0x01
#define     BMM_UR1R_CFG_UR1RPTY_HIGH       0x02
#define     BMM_UR1R_CFG_UR1RPTY_HIGHEST    0x03

/* Bit definition for BMM_UR1R_CR register */
#define     BMM_UR1R_CR_ENUR1R              0x80         /*!< function enable control bit: [0], disable; [1], enable */

#define     BMM_UR1R_CR_TRIG                0x20         /*!< Data read write trigger control bit: [0], disable; [1], enable */

#define     BMM_UR1R_CR_CLRFIFO             0x01         /*!< Clear UR1R_BMM receiving FIFO control bit: [0], disable; [1], enable */

/* Bit definition for BMM_UR1R_STA register */
#define     BMM_UR1R_STA_UR1RIF             0x01         /*!< UR1R interrupt request flag bit, when UR1R operation is completed, the hardware automatically places UR1RIF 1; software clearence */

#define     BMM_UR1R_STA_RXLOSS             0x02         /*!< Receive data discard flag bit */



/* Bit definition for BMM_UR2T_CFG register */
#define     BMM_UR2T_CFG_UR2TIE             0x80         /*!< Interrupt enable control bit: [0], disable; [1], enable */

#define     BMM_UR2T_CFG_UR2TIP             0x0C         /*!< UR2TIP[1:0], Interrupt priority control bit */
#define     BMM_UR2T_CFG_UR2TIP_0           0x04         /*!< Bit 0 */
#define     BMM_UR2T_CFG_UR2TIP_1           0x08         /*!< Bit 1 */

#define     BMM_UR2T_CFG_UR2TIP_LOWEST      0x00
#define     BMM_UR2T_CFG_UR2TIP_LOW         0x04
#define     BMM_UR2T_CFG_UR2TIP_HIGH        0x08
#define     BMM_UR2T_CFG_UR2TIP_HIGHEST     0x0C


#define     BMM_UR2T_CFG_UR2TPTY            0x03         /*!< UR2TPTY[1:0], Data bus access priority control bit */
#define     BMM_UR2T_CFG_UR2TPTY_0          0x01         /*!< Bit 0 */
#define     BMM_UR2T_CFG_UR2TPTY_1          0x02         /*!< Bit 1 */

#define     BMM_UR2T_CFG_UR2TPTY_LOWES      0x00
#define     BMM_UR2T_CFG_UR2TPTY_LOW        0x01
#define     BMM_UR2T_CFG_UR2TPTY_HIGH       0x02
#define     BMM_UR2T_CFG_UR2TPTY_HIGHEST    0x03

/* Bit definition for BMM_UR2T_CR register */
#define     BMM_UR2T_CR_ENUR2T              0x80         /*!< function enable control bit: [0], disable; [1], enable */
#define     BMM_UR2T_CR_TRIG                0x40         /*!< Data read write trigger control bit: [0], disable; [1], enable */

/* Bit definition for BMM_UR2T_STA register */
#define     BMM_UR2T_STA_UR2TIF             0x01         /*!< UR2T interrupt request flag bit, when UR2T operation is completed, the hardware automatically places UR2TIF 1; software clearence */

#define     BMM_UR2T_STA_TXOVW              0x04         /*!< Data overwrite flag bit */



/* Bit definition for BMM_UR2R_CFG register */
#define     BMM_UR2R_CFG_UR2RIE             0x80         /*!< Interrupt enable control bit: [0], disable; [1], enable */

#define     BMM_UR2R_CFG_UR2RIP             0x0C         /*!< UR2RIP[1:0], Interrupt priority control bit */
#define     BMM_UR2R_CFG_UR2RIP_0           0x04         /*!< Bit 0 */
#define     BMM_UR2R_CFG_UR2RIP_1           0x08         /*!< Bit 1 */

#define     BMM_UR2R_CFG_UR2RIP_LOWEST      0x00
#define     BMM_UR2R_CFG_UR2RIP_LOW         0x04
#define     BMM_UR2R_CFG_UR2RIP_HIGH        0x08
#define     BMM_UR2R_CFG_UR2RIP_HIGHEST     0x0C


