HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8hx.h
#define     BMM_UR2R_CFG_UR2RPTY            0x03         /*!< UR2RPTY[1:0], Data bus access priority control bit */
#define     BMM_UR2R_CFG_UR2RPTY_0          0x01         /*!< Bit 0 */
#define     BMM_UR2R_CFG_UR2RPTY_1          0x02         /*!< Bit 1 */

#define     BMM_UR2R_CFG_UR2RPTY_LOWES      0x00
#define     BMM_UR2R_CFG_UR2RPTY_LOW        0x01
#define     BMM_UR2R_CFG_UR2RPTY_HIGH       0x02
#define     BMM_UR2R_CFG_UR2RPTY_HIGHEST    0x03

/* Bit definition for BMM_UR2R_CR register */
#define     BMM_UR2R_CR_ENUR2R              0x80         /*!< function enable control bit: [0], disable; [1], enable */

#define     BMM_UR2R_CR_TRIG                0x20         /*!< Data read write trigger control bit: [0], disable; [1], enable */

#define     BMM_UR2R_CR_CLRFIFO             0x01         /*!< Clear UR2R_BMM receiving FIFO control bit: [0], disable; [1], enable */

/* Bit definition for BMM_UR2R_STA register */
#define     BMM_UR2R_STA_UR2RIF             0x01         /*!< UR2R interrupt request flag bit, when UR2R operation is completed, the hardware automatically places UR2RIF 1; software clearence */

#define     BMM_UR2R_STA_RXLOSS             0x02         /*!< Receive data discard flag bit */



/* Bit definition for BMM_UR3T_CFG register */
#define     BMM_UR3T_CFG_UR3TIE             0x80         /*!< Interrupt enable control bit: [0], disable; [1], enable */

#define     BMM_UR3T_CFG_UR3TIP             0x0C         /*!< UR3TIP[1:0], Interrupt priority control bit */
#define     BMM_UR3T_CFG_UR3TIP_0           0x04         /*!< Bit 0 */
#define     BMM_UR3T_CFG_UR3TIP_1           0x08         /*!< Bit 1 */

#define     BMM_UR3T_CFG_UR3TIP_LOWEST      0x00
#define     BMM_UR3T_CFG_UR3TIP_LOW         0x04
#define     BMM_UR3T_CFG_UR3TIP_HIGH        0x08
#define     BMM_UR3T_CFG_UR3TIP_HIGHEST     0x0C


#define     BMM_UR3T_CFG_UR3TPTY            0x03         /*!< UR3TPTY[1:0], Data bus access priority control bit */
#define     BMM_UR3T_CFG_UR3TPTY_0          0x01         /*!< Bit 0 */
#define     BMM_UR3T_CFG_UR3TPTY_1          0x02         /*!< Bit 1 */

#define     BMM_UR3T_CFG_UR3TPTY_LOWES      0x00
#define     BMM_UR3T_CFG_UR3TPTY_LOW        0x01
#define     BMM_UR3T_CFG_UR3TPTY_HIGH       0x02
#define     BMM_UR3T_CFG_UR3TPTY_HIGHEST    0x03

/* Bit definition for BMM_UR3T_CR register */
#define     BMM_UR3T_CR_ENUR3T              0x80         /*!< function enable control bit: [0], disable; [1], enable */
#define     BMM_UR3T_CR_TRIG                0x40         /*!< Data read write trigger control bit: [0], disable; [1], enable */

/* Bit definition for BMM_UR3T_STA register */
#define     BMM_UR3T_STA_UR3TIF             0x01         /*!< UR3T interrupt request flag bit, when UR3T operation is completed, the hardware automatically places UR3TIF 1; software clearence */

#define     BMM_UR3T_STA_TXOVW              0x04         /*!< Data overwrite flag bit */



/* Bit definition for BMM_UR3R_CFG register */
#define     BMM_UR3R_CFG_UR3RIE             0x80         /*!< Interrupt enable control bit: [0], disable; [1], enable */

#define     BMM_UR3R_CFG_UR3RIP             0x0C         /*!< UR3RIP[1:0], Interrupt priority control bit */
#define     BMM_UR3R_CFG_UR3RIP_0           0x04         /*!< Bit 0 */
#define     BMM_UR3R_CFG_UR3RIP_1           0x08         /*!< Bit 1 */

#define     BMM_UR3R_CFG_UR3RIP_LOWEST      0x00
#define     BMM_UR3R_CFG_UR3RIP_LOW         0x04
#define     BMM_UR3R_CFG_UR3RIP_HIGH        0x08
#define     BMM_UR3R_CFG_UR3RIP_HIGHEST     0x0C


#define     BMM_UR3R_CFG_UR3RPTY            0x03         /*!< UR3RPTY[1:0], Data bus access priority control bit */
#define     BMM_UR3R_CFG_UR3RPTY_0          0x01         /*!< Bit 0 */
#define     BMM_UR3R_CFG_UR3RPTY_1          0x02         /*!< Bit 1 */

#define     BMM_UR3R_CFG_UR3RPTY_LOWES      0x00
#define     BMM_UR3R_CFG_UR3RPTY_LOW        0x01
#define     BMM_UR3R_CFG_UR3RPTY_HIGH       0x02
#define     BMM_UR3R_CFG_UR3RPTY_HIGHEST    0x03

/* Bit definition for BMM_UR3R_CR register */
#define     BMM_UR3R_CR_ENUR3R              0x80         /*!< function enable control bit: [0], disable; [1], enable */

#define     BMM_UR3R_CR_TRIG                0x20         /*!< Data read write trigger control bit: [0], disable; [1], enable */

#define     BMM_UR3R_CR_CLRFIFO             0x01         /*!< Clear UR3R_BMM receiving FIFO control bit: [0], disable; [1], enable */

/* Bit definition for BMM_UR3R_STA register */
#define     BMM_UR3R_STA_UR3RIF             0x01         /*!< UR3R interrupt request flag bit, when UR3R operation is completed, the hardware automatically places UR3RIF 1; software clearence */

#define     BMM_UR3R_STA_RXLOSS             0x02         /*!< Receive data discard flag bit */




/* Bit definition for BMM_UR4T_CFG register */
#define     BMM_UR4T_CFG_UR4TIE             0x80         /*!< Interrupt enable control bit: [0], disable; [1], enable */

#define     BMM_UR4T_CFG_UR4TIP             0x0C         /*!< UR4TIP[1:0], Interrupt priority control bit */
#define     BMM_UR4T_CFG_UR4TIP_0           0x04         /*!< Bit 0 */
#define     BMM_UR4T_CFG_UR4TIP_1           0x08         /*!< Bit 1 */

#define     BMM_UR4T_CFG_UR4TIP_LOWEST      0x00
#define     BMM_UR4T_CFG_UR4TIP_LOW         0x04
#define     BMM_UR4T_CFG_UR4TIP_HIGH        0x08
#define     BMM_UR4T_CFG_UR4TIP_HIGHEST     0x0C


#define     BMM_UR4T_CFG_UR4TPTY            0x03         /*!< UR4TPTY[1:0], Data bus access priority control bit */
#define     BMM_UR4T_CFG_UR4TPTY_0          0x01         /*!< Bit 0 */
#define     BMM_UR4T_CFG_UR4TPTY_1          0x02         /*!< Bit 1 */

#define     BMM_UR4T_CFG_UR4TPTY_LOWES      0x00
#define     BMM_UR4T_CFG_UR4TPTY_LOW        0x01
#define     BMM_UR4T_CFG_UR4TPTY_HIGH       0x02
#define     BMM_UR4T_CFG_UR4TPTY_HIGHEST    0x03

/* Bit definition for BMM_UR4T_CR register */
#define     BMM_UR4T_CR_ENUR4T              0x80         /*!< function enable control bit: [0], disable; [1], enable */
#define     BMM_UR4T_CR_TRIG                0x40         /*!< Data read write trigger control bit: [0], disable; [1], enable */

/* Bit definition for BMM_UR4T_STA register */
#define     BMM_UR4T_STA_UR4TIF             0x01         /*!< UR4T interrupt request flag bit, when UR4T operation is completed, the hardware automatically places UR4TIF 1; software clearence */

#define     BMM_UR4T_STA_TXOVW              0x04         /*!< Data overwrite flag bit */



/* Bit definition for BMM_UR4R_CFG register */
#define     BMM_UR4R_CFG_UR4RIE             0x80         /*!< Interrupt enable control bit: [0], disable; [1], enable */

