HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8hx.h
#define     BMM_UR4R_CFG_UR4RIP             0x0C         /*!< UR4RIP[1:0], Interrupt priority control bit */
#define     BMM_UR4R_CFG_UR4RIP_0           0x04         /*!< Bit 0 */
#define     BMM_UR4R_CFG_UR4RIP_1           0x08         /*!< Bit 1 */

#define     BMM_UR4R_CFG_UR4RIP_LOWEST      0x00
#define     BMM_UR4R_CFG_UR4RIP_LOW         0x04
#define     BMM_UR4R_CFG_UR4RIP_HIGH        0x08
#define     BMM_UR4R_CFG_UR4RIP_HIGHEST     0x0C


#define     BMM_UR4R_CFG_UR4RPTY            0x03         /*!< UR4RPTY[1:0], Data bus access priority control bit */
#define     BMM_UR4R_CFG_UR4RPTY_0          0x01         /*!< Bit 0 */
#define     BMM_UR4R_CFG_UR4RPTY_1          0x02         /*!< Bit 1 */

#define     BMM_UR4R_CFG_UR4RPTY_LOWES      0x00
#define     BMM_UR4R_CFG_UR4RPTY_LOW        0x01
#define     BMM_UR4R_CFG_UR4RPTY_HIGH       0x02
#define     BMM_UR4R_CFG_UR4RPTY_HIGHEST    0x03

/* Bit definition for BMM_UR4R_CR register */
#define     BMM_UR4R_CR_ENUR4R              0x80         /*!< function enable control bit: [0], disable; [1], enable */

#define     BMM_UR4R_CR_TRIG                0x20         /*!< Data read write trigger control bit: [0], disable; [1], enable */

#define     BMM_UR4R_CR_CLRFIFO             0x01         /*!< Clear UR4R_BMM receiving FIFO control bit: [0], disable; [1], enable */

/* Bit definition for BMM_UR4R_STA register */
#define     BMM_UR4R_STA_UR4RIF             0x01         /*!< UR4R interrupt request flag bit, when UR4R operation is completed, the hardware automatically places UR4RIF 1; software clearence */

#define     BMM_UR4R_STA_RXLOSS             0x02         /*!< Receive data discard flag bit */





/* Bit definition for BMM_LCM_CFG register */
#define     BMM_LCM_CFG_LCMIE               0x80         /*!< Interrupt enable control bit: [0], disable; [1], enable */

#define     BMM_LCM_CFG_LCMIP               0x0C         /*!< LCMIP[1:0], Interrupt priority control bit */
#define     BMM_LCM_CFG_LCMIP_0             0x04         /*!< Bit 0 */
#define     BMM_LCM_CFG_LCMIP_1             0x08         /*!< Bit 1 */

#define     BMM_LCM_CFG_LCMIP_LOWEST        0x00
#define     BMM_LCM_CFG_LCMIP_LOW           0x04
#define     BMM_LCM_CFG_LCMIP_HIGH          0x08
#define     BMM_LCM_CFG_LCMIP_HIGHEST       0x0C


#define     BMM_LCM_CFG_LCMPTY              0x03         /*!< LCMPTY[1:0], Data bus access priority control bit */
#define     BMM_LCM_CFG_LCMPTY_0            0x01         /*!< Bit 0 */
#define     BMM_LCM_CFG_LCMPTY_1            0x02         /*!< Bit 1 */

#define     BMM_LCM_CFG_LCMPTY_LOWES        0x00
#define     BMM_LCM_CFG_LCMPTY_LOW          0x01
#define     BMM_LCM_CFG_LCMPTY_HIGH         0x02
#define     BMM_LCM_CFG_LCMPTY_HIGHEST      0x03

/* Bit definition for BMM_LCM_CR register */
#define     BMM_LCM_CR_ENLCM                0x80         /*!< function enable control bit: [0], disable; [1], enable */

#define     BMM_LCM_CR_TRIGWC               0x40         /*!< Send command mode trigger control bit: [0], disable; [1], enable */

#define     BMM_LCM_CR_TRIGWD               0x20         /*!< Send data mode trigger control bit: [0], disable; [1], enable */

#define     BMM_LCM_CR_TRIGRC               0x10         /*!< Read command mode trigger control bit: [0], disable; [1], enable */

#define     BMM_LCM_CR_TRIGRD               0x08         /*!< Read data mode trigger control bit: [0], disable; [1], enable */

#define     BMM_LCM_CR_CLRFIFO              0x01         /*!< Clear LCM_BMM receiving FIFO control bit: [0], disable; [1], enable */

/* Bit definition for BMM_LCM_STA register */
#define     BMM_LCM_STA_LCMIF               0x01         /*!< LCM interrupt request flag bit, when LCM operation is completed, the hardware automatically places LCMIF 1; software clearence */

#define     BMM_LCM_STA_TXOVW               0x02         /*!< Data overwrite flag bit */

//! I2C peripherals
/**
 * @brief I2C general I/O configuration
 */
struct I2C_struct{
    __IO uint8_t I2CCFG;
    __IO uint8_t I2CMSCR;
    __IO uint8_t I2CMSST;
    __IO uint8_t I2CSLCR;
    __IO uint8_t I2CSLST;
    __IO uint8_t I2CSLADR;
    __IO uint8_t I2CTXD;
    __IO uint8_t I2CRXD;
    __IO uint8_t I2CMSAUX;
};
#define I2C_TypeDef struct I2C_struct

/* Basic address */
#define     I2C_BASE        0xFE80
#define     I2CCFG_ADDR     (I2C_BASE + 0x0000)
#define     I2CMSCR_ADDR    (I2C_BASE + 0x0001)
#define     I2CMSST_ADDR    (I2C_BASE + 0x0002)
#define     I2CSLCR_ADDR    (I2C_BASE + 0x0003)
#define     I2CSLST_ADDR    (I2C_BASE + 0x0004)
#define     I2CSLADR_ADDR   (I2C_BASE + 0x0005)
#define     I2CTXD_ADDR     (I2C_BASE + 0x0006)
#define     I2CRXD_ADDR     (I2C_BASE + 0x0007)
#define     I2CMSAUX_ADDR   (I2C_BASE + 0x0008)

/* Bit definition for I2CCFG register */
// The wait parameter set by the MSSPEED parameter is valid only if the I2C module is working in host mode.
#define     I2CCFG_ENI2C    0x80             /*!< I2C fucntion enablling control bit: [0], disable; [1], enable */
#define     I2CCFG_MSSL     0x40             /*!< I2C fucntion selection: [0], slave; [1], master */

#define     I2CCFG_MSSPEED            0x3F       /*!< MSSPEED[5:0], I2C bus speed control (waiting ticks) I2C_speed = Fosc/2/(MSSPEED * 2 + 4)*/
#define     I2CCFG_MSSPEED_0          0x01       /*!< Bit 0 */
#define     I2CCFG_MSSPEED_1          0x02       /*!< Bit 1 */
#define     I2CCFG_MSSPEED_2          0x04       /*!< Bit 2 */
#define     I2CCFG_MSSPEED_3          0x08       /*!< Bit 3 */
#define     I2CCFG_MSSPEED_4          0x10       /*!< Bit 4 */
#define     I2CCFG_MSSPEED_5          0x20       /*!< Bit 5 */

#define     I2CCFG_MSSPEED_VAL0       0x00      /*!< tick_n=0+4 */
#define     I2CCFG_MSSPEED_VAL1       0x01      /*!< tick_n=1+4 */
#define     I2CCFG_MSSPEED_VAL2       0x02      /*!< tick_n=2+4 */
#define     I2CCFG_MSSPEED_VAL3       0x03      /*!< tick_n=3+4 */
#define     I2CCFG_MSSPEED_VAL4       0x04      /*!< tick_n=4+4 */
#define     I2CCFG_MSSPEED_VAL5       0x05      /*!< tick_n=5+4 */
#define     I2CCFG_MSSPEED_VAL6       0x06      /*!< tick_n=6+4 */
#define     I2CCFG_MSSPEED_VAL7       0x07      /*!< tick_n=7+4 */
#define     I2CCFG_MSSPEED_VAL8       0x08      /*!< tick_n=8+4 */
#define     I2CCFG_MSSPEED_VAL9       0x09      /*!< tick_n=9+4 */
#define     I2CCFG_MSSPEED_VAL10      0x0A      /*!< tick_n=10+4 */
#define     I2CCFG_MSSPEED_VAL11      0x0B      /*!< tick_n=11+4 */
#define     I2CCFG_MSSPEED_VAL12      0x0C      /*!< tick_n=12+4 */
#define     I2CCFG_MSSPEED_VAL13      0x0D      /*!< tick_n=13+4 */
#define     I2CCFG_MSSPEED_VAL14      0x0E      /*!< tick_n=14+4 */
#define     I2CCFG_MSSPEED_VAL15      0x0F      /*!< tick_n=15+4 */
#define     I2CCFG_MSSPEED_VAL16      0x10      /*!< tick_n=16+4 */
#define     I2CCFG_MSSPEED_VAL17      0x11      /*!< tick_n=17+4 */
#define     I2CCFG_MSSPEED_VAL18      0x12      /*!< tick_n=18+4 */
#define     I2CCFG_MSSPEED_VAL19      0x13      /*!< tick_n=19+4 */
#define     I2CCFG_MSSPEED_VAL20      0x14      /*!< tick_n=20+4 */
#define     I2CCFG_MSSPEED_VAL21      0x15      /*!< tick_n=21+4 */
#define     I2CCFG_MSSPEED_VAL22      0x16      /*!< tick_n=22+4 */
#define     I2CCFG_MSSPEED_VAL23      0x17      /*!< tick_n=23+4 */
#define     I2CCFG_MSSPEED_VAL24      0x18      /*!< tick_n=24+4 */
#define     I2CCFG_MSSPEED_VAL25      0x19      /*!< tick_n=25+4 */
#define     I2CCFG_MSSPEED_VAL26      0x1A      /*!< tick_n=26+4 */
#define     I2CCFG_MSSPEED_VAL27      0x1B      /*!< tick_n=27+4 */
#define     I2CCFG_MSSPEED_VAL28      0x1C      /*!< tick_n=28+4 */
#define     I2CCFG_MSSPEED_VAL29      0x1D      /*!< tick_n=29+4 */
#define     I2CCFG_MSSPEED_VAL30      0x1E      /*!< tick_n=30+4 */
#define     I2CCFG_MSSPEED_VAL31      0x1F      /*!< tick_n=31+4 */
#define     I2CCFG_MSSPEED_VAL32      0x20      /*!< tick_n=32+4 */
#define     I2CCFG_MSSPEED_VAL33      0x21      /*!< tick_n=33+4 */
#define     I2CCFG_MSSPEED_VAL34      0x22      /*!< tick_n=34+4 */
#define     I2CCFG_MSSPEED_VAL35      0x23      /*!< tick_n=35+4 */
#define     I2CCFG_MSSPEED_VAL36      0x24      /*!< tick_n=36+4 */
#define     I2CCFG_MSSPEED_VAL37      0x25      /*!< tick_n=37+4 */
#define     I2CCFG_MSSPEED_VAL38      0x26      /*!< tick_n=38+4 */
#define     I2CCFG_MSSPEED_VAL39      0x27      /*!< tick_n=39+4 */
#define     I2CCFG_MSSPEED_VAL40      0x28      /*!< tick_n=40+4 */
#define     I2CCFG_MSSPEED_VAL41      0x29      /*!< tick_n=41+4 */
#define     I2CCFG_MSSPEED_VAL42      0x2A      /*!< tick_n=42+4 */
#define     I2CCFG_MSSPEED_VAL43      0x2B      /*!< tick_n=43+4 */
#define     I2CCFG_MSSPEED_VAL44      0x2C      /*!< tick_n=44+4 */
#define     I2CCFG_MSSPEED_VAL45      0x2D      /*!< tick_n=45+4 */
#define     I2CCFG_MSSPEED_VAL46      0x2E      /*!< tick_n=46+4 */
#define     I2CCFG_MSSPEED_VAL47      0x2F      /*!< tick_n=47+4 */
#define     I2CCFG_MSSPEED_VAL48      0x30      /*!< tick_n=48+4 */
#define     I2CCFG_MSSPEED_VAL49      0x31      /*!< tick_n=49+4 */
#define     I2CCFG_MSSPEED_VAL50      0x32      /*!< tick_n=50+4 */
#define     I2CCFG_MSSPEED_VAL51      0x33      /*!< tick_n=51+4 */
#define     I2CCFG_MSSPEED_VAL52      0x34      /*!< tick_n=52+4 */
#define     I2CCFG_MSSPEED_VAL53      0x35      /*!< tick_n=53+4 */
#define     I2CCFG_MSSPEED_VAL54      0x36      /*!< tick_n=54+4 */
#define     I2CCFG_MSSPEED_VAL55      0x37      /*!< tick_n=55+4 */
#define     I2CCFG_MSSPEED_VAL56      0x38      /*!< tick_n=56+4 */
#define     I2CCFG_MSSPEED_VAL57      0x39      /*!< tick_n=57+4 */
#define     I2CCFG_MSSPEED_VAL58      0x3A      /*!< tick_n=58+4 */
#define     I2CCFG_MSSPEED_VAL59      0x3B      /*!< tick_n=59+4 */
#define     I2CCFG_MSSPEED_VAL60      0x3C      /*!< tick_n=60+4 */
#define     I2CCFG_MSSPEED_VAL61      0x3D      /*!< tick_n=61+4 */
#define     I2CCFG_MSSPEED_VAL62      0x3E      /*!< tick_n=62+4 */
#define     I2CCFG_MSSPEED_VAL63      0x3F      /*!< tick_n=63+4 */


/* Bit definition for I2CMSCR register */
#define     I2CMSCR_EMSI        0x80             /*!< master mode interrupt enabling control bit */

#define     I2CMSCR_MSCMD       0x0F             /*!< MSCMD[3:0], master command */
#define     I2CMSCR_MSCMD_0     0x01             /*!< Bit 0 */
#define     I2CMSCR_MSCMD_1     0x02             /*!< Bit 1 */
#define     I2CMSCR_MSCMD_2     0x04             /*!< Bit 2 */
#define     I2CMSCR_MSCMD_3     0x08             /*!< Bit 3 */

#define     I2CMSCR_MSCMD_IDLE      0x00             /*!< idle, no action */
#define     I2CMSCR_MSCMD_START     0x01             /*!< start command */
#define     I2CMSCR_MSCMD_SEND_DATA 0x02             /*!< send data command */
#define     I2CMSCR_MSCMD_RECV_ACK  0x03             /*!< receive ACK command */
#define     I2CMSCR_MSCMD_RECV_DATA 0x04             /*!< receive data command */
#define     I2CMSCR_MSCMD_SEND_ACK  0x05             /*!< send ACK command */
#define     I2CMSCR_MSCMD_STOP      0x06             /*!< stop command */
#define     I2CMSCR_MSCMD_SSDRACK   0x09             /*!< Start Command + SEND Data Command + receive ACK command */
#define     I2CMSCR_MSCMD_SDRACK    0x0A             /*!< Send Data Command + receive ACK command */
#define     I2CMSCR_MSCMD_RDSACK0   0x0B             /*!< Receive Data Command + send ACK (0) command */
#define     I2CMSCR_MSCMD_RDSNAK1   0x0C             /*!< Receive Data Command + send NAK (1) command. */

/* Bit definition for I2CMSST register */
#define     I2CMSST_MSBUSY          0x80             /*!< I2C control bit on master mode. [0], idle; [1], busy(READ ONLY) */
#define     I2CMSST_MSIF            0x40             /*!< master mode interrupt request bit (interrupt flag bit)) */
#define     I2CMSST_MSACKI          0x02             /*!< master mode, ACK received after '0011' command sent to I2CMSCR-MSCMD */
#define     I2CMSST_MSACKO          0x01             /*!< master mode, ACK signal wait to be sent */

/* Bit definition for I2CSLCR register ([0], disable; [1], enable)*/
#define     I2CSLCR_ESTAI           0x40             /*!< The START signal interrupt permission bit is received from the slave mode */
#define     I2CSLCR_ERXI            0x20             /*!< Interrupt allowed bit after receiving 1 byte data from slave mode */
#define     I2CSLCR_ETXI            0x10             /*!< Interrupt allowed bit after sending 1 byte data from slave mode */
#define     I2CSLCR_ESTOI           0x08             /*!< Receive STOP signal interrupt permission bit from slave mode */
#define     I2CSLCR_SLRST           0x01             /*!< Reset slave mode */

