HangX-Ma/MiniScpoe-STC8A/Libraries/CoreSupport/config/stc8x/config_stc8hx.h
/* Bit definition for I2CSLST register */
#define     I2CSLST_SLBUSY          0x80             /*!< slave mode interrupt enabling control bit */
#define     I2CSLST_STAIF           0x40             /*!< The interrupt request bit after the START signal is received from slave mode. */
#define     I2CSLST_RXIF            0x20             /*!< Interrupt request bit after receiving 1 byte of data from slave mode */
#define     I2CSLST_TXIF            0x10             /*!< Interrupt request bit after 1 byte of data has been sent from slave mode */
#define     I2CSLST_STOIF           0x08             /*!< The interrupt request bit after the STOP signal is received from slave mode */
// #define     I2CSLST_TXING           0x04             
#define     I2CSLST_SLACKI          0x02             /*!< ACK data received when in slave mode */
#define     I2CSLST_SLACKO          0x01             /*!< ACK signal to be sent on slave mode */

/* Bit definition for I2CMSAUX register */
#define     I2CMSAUX_WDTA           0x01             /*!< I2C data is automatically sent in master mode allowing bits */


/* I2C special function registers */
#define     I2CCFG          (*(__IO uint8_t xdata *) I2CCFG_ADDR)    //!< I2C configuration register
#define     I2CMSCR         (*(__IO uint8_t xdata *) I2CMSCR_ADDR)   //!< I2C master control register
#define     I2CMSST         (*(__IO uint8_t xdata *) I2CMSST_ADDR)   //!< I2C master state register
#define     I2CSLCR         (*(__IO uint8_t xdata *) I2CSLCR_ADDR)   //!< I2C slave control register
#define     I2CSLST         (*(__IO uint8_t xdata *) I2CSLST_ADDR)   //!< I2C slave state register
#define     I2CSLADR        (*(__IO uint8_t xdata *) I2CSLADR_ADDR)  //!< I2C slave address register
#define     I2CTXD          (*(__IO uint8_t xdata *) I2CTXD_ADDR)    //!< I2C data sending register
#define     I2CRXD          (*(__IO uint8_t xdata *) I2CRXD_ADDR)    //!< I2C data reveiving register
#define     I2CMSAUX        (*(__IO uint8_t xdata *) I2CMSAUX_ADDR)  //!< I2C master auxiliary control register

#define     I2C             ((I2C_TypeDef xdata *) I2C_BASE)        //!< I2C generic struct type definition

//! MDU peripherals
/**
 * @brief MDU general I/O configuration
 */
struct MDU16_struct{
    __IO uint8_t MD3_REG;     /*---- MDU Divisor data register */
    __IO uint8_t MD2_REG;     /*---- MDU Divisor data register */
    __IO uint8_t MD1_REG;     /*---- MDU Divisor data register   */	
    __IO uint8_t MD0_REG;     /*---- MDU Divisor data register  */
    __IO uint8_t MD5_REG;     /*---- MDU Divisor data register */
    __IO uint8_t MD4_REG;     /*---- MDU Divisor data register */ 
    __IO uint8_t ARCON_REG;   /*----MDU module data registe */
    __IO uint8_t OPCON_REG;   /*----MDU control data registe */
};
#define MDU16_TypeDef struct MDU16_struct
/* Basic address */
#define     MDU16_BASE       (0xFCF0U)

#define     MD3_ADDRESS      (MDU16_BASE)
#define     MD2_ADDRESS      (MDU16_BASE + 0x0001U)
#define     MD1_ADDRESS      (MDU16_BASE + 0x0002U)
#define     MD0_ADDRESS      (MDU16_BASE + 0x0003U)
#define     MD5_ADDRESS      (MDU16_BASE + 0x0004U)
#define     MD4_ADDRESS      (MDU16_BASE + 0x0005U)
#define     ARCON_ADDRESS    (MDU16_BASE + 0x0006U)
#define     OPCON_ADDRESS    (MDU16_BASE + 0x0007U)

/* Bit definition for ARCON register */
#define     ARCON_MODE              0xE0    /*!< MODE[2:0], MDU mode selection */
#define     ARCON_MODE_0            0x20    /*!< BIT 0 */
#define     ARCON_MODE_1            0x40    /*!< BIT 1 */
#define     ARCON_MODE_2            0x80    /*!< BIT 2 */

#define     ARCON_MODE_SHR          0x20    /*!< shift right logical */
#define     ARCON_MODE_SHL          0x40    /*!< shift left logical */
#define     ARCON_MODE_Normalized   0x60    /*!< Normalized */
#define     ARCON_MODE_16MUL16      0x80    /*!< 16 bits multiply 16 bits */
#define     ARCON_MODE_16DIV16      0xA0    /*!< 16 bits divide 16 bits */
#define     ARCON_MODE_32DIV16      0xC0    /*!< 32 bits multiply 16 bits */

#define     ARCON_SC                0x1F    /*!< SC[4:0], Data movement digits */
#define     ARCON_SC_0              0x01    /*!< BIT 0 */
#define     ARCON_SC_1              0x02    /*!< BIT 1 */
#define     ARCON_SC_2              0x04    /*!< BIT 2 */
#define     ARCON_SC_3              0x08    /*!< BIT 3 */
#define     ARCON_SC_4              0x10    /*!< BIT 4 */


/* Bit definition for OPCON register */
#define     OPCON_MDOV       0x40    /*!< overflow flag, READ ONLY */
#define     OPCON_RST        0x02    /*!< Software reset MDU multiplication and division unit */
#define     OPCON_ENOP       0x01    /*!< MDU module enabled. When the MDU computation is complete, the hardware automatically resets the ENOP: [0], idle; [1], enable */


/* MDU16 special function registers */
#define     MDU16       ((MDU16_TypeDef  xdata *) MDU16_BASE)

#define     MD3U32      (*(__IO uint32_t xdata *)  MD3_ADDRESS)
#define     MD3U16      (*(__IO uint16_t xdata *)  MD3_ADDRESS)
#define     MD1U16      (*(__IO uint16_t xdata *)  MD1_ADDRESS)
#define     MD5U16      (*(__IO uint16_t xdata *)  MD5_ADDRESS)

#define     MD3         (*(__IO uint8_t xdata *)  MD3_ADDRESS)
#define     MD2         (*(__IO uint8_t xdata *)  MD2_ADDRESS)
#define     MD1         (*(__IO uint8_t xdata *)  MD1_ADDRESS)
#define     MD0         (*(__IO uint8_t xdata *)  MD0_ADDRESS)
#define     MD5         (*(__IO uint8_t xdata *)  MD5_ADDRESS)
#define     MD4         (*(__IO uint8_t xdata *)  MD4_ADDRESS)

#define     ARCON       (*(__IO uint8_t xdata *)  ARCON_ADDRESS) //! MDU Mode Control Register
#define     OPCON       (*(__IO uint8_t xdata *)  OPCON_ADDRESS) //! MDU Operation Control Register




/** @} */

/** @} */

/** @} */

#endif

